[{"rating": [], "price": [" 1,169.00", " 1,169.00", " 1,169.00", " 1,170.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  i checked keyboard and mouse in my office from 15 foot distance and also from other cabin also work so,", "this is very very very nice wifi range and auto shutoff system for battery life , when you not touch mouse and keyboard for 30 second they they automatic shut off so BATTERY SAVING mode automatic activated after 30 second.", "- keyborad stock is very very smooth, not like microsoft and iball but compare to other keyboard this is MAKHKHAN", "- keyboard up key is very small otherwise all key are good.", "- very small and with FN (function key) for space saving keyboard and giving all function with this key like", "  HOME, EMAIL, SEARCH, CALCULATOR, MUSIC ,BACK, PAUSE, NEXT, MUTE, VOL DOWN , VOL UP, PRINT SCR, &  PAUSE/B.", "-  come with 2 AA battery pack and 2 AAA battery pack and both are premium GP ALKLINE BATTERY PACK.", "-  mouse working on my office table without mouse pad.", "-  go for this and save your space on table in this type of small and powerful ranging keyboard you not finding in any other brand in 1000 rs.", "thanks amazon very very very fast delivery and very very nice 3 layer packaging. i think packaging coasting is nearly 50 to 70 rs. so thats about BEST SERVICE FROM AMAZON.", "AMAZON TRACKING UPDATE WITH SHARP TIMING ON SMS AND EMAIL BOTH .SO TURN OFF YOU EYES GO FOR AMAZON.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Pros:", "Keyboard is sturdy, small form factor.", "Pre-defined volume control keys. Function keys can be customized using Logitech SetPoint software.", "Full sized mouse with invisible optics.", "Customizable mouse middle button (via SetPoint).", "No visible LEDs in mouse or keyboard to save battery.", "High DPI mouse, better that cheaper wired variants.", "Relatively longer battery life, as compared to other brands.", "Highly suitable for students, internet users, casual gamers.", "Saves desktop space.", "Cons:", "Mouse battery cover is a little loose. Cover opens up when is used on rough surfaces, like on fabrics or rough denims.", "Both mouse and keyboard lacks on/off switch. Battery is to be removed to turn off mouse or keyboard.", "No status indicator LEDs on keyboard. SetPoint software is to be installed for OSD and battery level indication.", "The keys at the edges (function keys and arrow keys) are too crammed.", "Not suitable for heavy use or hard-core gaming.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Delivery experience is good, I have opted for standard delivery, they tried to deliver on 3rd day but did not find the address, delivery person called me on 4th day and found the address and delivered it.", "About the product, Logitech MK220 Keyboard is not up to my expectation, the disappointment is that the key board and mouse have no power button(s). Once we load the batteries we do not have control on the power and the gadgets. on the key board it is mentioned about 'Auto sleep' but not sure how efficient it is. In spite of keyboard's Auto sleep feature, I feel the power control button is very important to control the function of the key board especially to avoid interruptions due to unintentional press/moves, same with the mouse. The key board layout is very tight, of course it is compact but it is little uncomfortable when to deal with the buttons on the edges. And unlike other branded mouses, the Logitech mouse needs two AA batteries.", "Overall its not a great product but if you are not so concerned about power buttons and the compactness of the keyboard, you may still go for it.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  ADVANTAGES:", "*key board functions good as the keys are very easy to type", "*small size of keyboard looks handsome", "*mouse have a good weight and is very user friendly", "DISADVANTAGES:", "*key board and mouse works only when it is only very close to the reciever", "other mouses (adwick) can even works at distances", "*no indicators to check the activation of CAPS LOCK, NUMBER KEYS so it makes difficuilties in typing passwords", "*invisible optical to check mouse\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Near perfect compact wireless Keyboard. Soft, silent, well positioned keys with good tactile feedback.Function Keys in the top and up/down, Left/Right arrow keys made smaller to achieve compactness. Should not matter for most users and if it does matter to you, look elsewhere and not a compact Keyboard.", "Ergonomic mouse that feels natural to hold with smooth cursor movement. Smooth scroll wheel. Comparable to the good performance of the much costlier MK305 wireless mouse ( which I have been using for many years.)", "2.4 GHz wireless connectivity. In my environment worked fine with no connectivity issues.USB receiver could have been a little smaller. ( The USB receiver of my MK305 mouse is much smaller and hardly comes in the way when packing the laptop.)", "Plug and Play. For added features users can download and install the Setpoint software. (free).", "Overall, for the price it is an an excellent , compact, lightweight KB and mouse to carry with the laptop. 3 years Logitech warranty. Can't ask for more.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Product is good and delivered quite quickly in very good condition. Mouse is very good to operate but keyboard is not. Keys are very small and closely placed. Need lots of practice to press the right key otherwise you end up in pressing multiple keys and sometimes wrong key. I would recommend to use a full sized keyboard like desktop keyboard and not this one.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Logitech MK220 Wireless Keyboard and Mouse Combo (Black)"]},
{"rating": [], "price": [" 332.00", " 333.00", " 333.00", " 333.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  It is basic mouse from Logitech, working without a hitch. I felt the size of the mouse was perfect when compared to other optical ones that used previously - they were small relatively.", "The product was delivered on time nicely packed.", "It is suggested to go amazon fulfilled products as it provides you better visibility to keep a track of the product till it is delivered. Not sure though if this also happens on non-amazon fulfilled items.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  PROS:", "1) Product delivered as advertised.", "2) Amazon kept their promise of quick delivery.", "3) Packing was good and the product was intact, without any damage(s).", "4) The quality of the product is very good and it feels good in your hands, whether you have a large palm, or small.", "5) Cable is reasonably lengthy, and is of good quality as expected from Logitech.", "6) Smooth scrolling and the scroll wheel can be configured as a button (3 buttons Mouse)", "CONS:", "1) If you used a Mouse with soft button clicks before, you might find this one a little unsettling because the buttons are much harder than the usual, and it takes some time to get used to.", "2) Pointer moves smoothly with fast movements, but small movements aren't responding very well, but it may be due to the Logitech software I have on my desktop computer, which I had configured to use with my previous Logitech Mouse.", "This could be a little annoying if you use Image editing software and you want to do small selections on the images.", "3) Lacks the physical scroll wheel movement for horizontal scrolling. Can only be configured via. Logitech software.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  the best mouse but so underrated.. the build quality is top notch.. i have used this mouse for hardcore gaming.. and it worked like a charm.. i think it will compete to the price range till 1500/- it is that good..", "it is the best overall package.. it is the reason why people are migrating from wireless to wired mouse.. even though you can get wireless once for the same price you would have to buy this one for the ease..", "10/10  its my third mouse, same one.. in three years.. for me it works at an one mouse/year ratio..  the reason i never changed the brand or model is that i broke four mouse both wired and wireless types before i found this model.. the normal models does not keep up to my gaming needs.. you cant say its a gaming mouse.. but the performance is so good you can compare it to a gaming mouse..", "every budget pc gamer's delight.. just go for it and use the best one around.. it is a tvs gold of the mouse..\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  It is nice and value for money , good for office use, good rough and tough mouse it is .\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Everyone knws Logitech is a well branded company in terms of computer accessories. That's y I chose Logitech mouse for my laptop. Its been one month and the product is very nic and its premium finish makes it more attractive. Buy this mouse if you are looking for a best mouse under 500Rs.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Logitech M100r is a great mouse overall. The grip and handling is superb - during navigation, scroll and clicks. A good mouse to have. But having used M100 too personally, I would rate that as an even better mouse. M100 is slightly heavier than M100r giving more control over its movements.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  product is good and comfortable.. no issues.. my previous mouse was also logitech it lasted 3 years.. so i was looking for same logitech design mouse.. i checked in market its MRP is 495.. the least amount shop keeper offered me was 450.. not less than that..", "amazon is selling at 280Rs.. ty amazon for low price..", "i also want to thank amazon for quick delivery.. i got the product in 20 hrs from ordering.. even though it was raining heavily in evening delivery guy delivered product. packaging is awesome.. product was brand new and sealed pack...\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Product is best in such a price...", "As being a designing professional I needed a mouse which can stick to a multi-clicks job....and here I take a risk on this and no doubt, found the right product..Will recommend to all looking for a slight heavy and large handy size mice..as fits perfectly in your hand..works smoothly..!\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Logitech M100r Wired USB Mouse (Dark Black)"]},
{"rating": [], "price": [" 558.00", " 560.00", " 569.00", " 559.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Let me tell all of you that this mouse is very nice and one of the good product. I was firstly purched it but when I received it i found that the back side sensor light was not glowing. I returned it back to amezon..all the amount has been credited in my account. I thought it was a defect. Again I placed an order for the same. And again I found the back side senso light was not glowing. But this time i get in touch with the Dell and I got my answer that in this mouse No LED light facility because of battry consumption. To save more power in battry it was not present.", "So just for you all that this is not a defect .. this facility is not there because of preveting the battry consumption. So do not understand like me that this is a defect in product...Product is excellent... Again i highly appriciate Amezon service here. Gr8 Job Amezon !!\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  The same mouse was available for 700+ where as amazon sold it for 640 :) but now its selling it for 560 :\\", "thanx amazon", "About the product:", "It has BUTTON which opens the DELL part of the mouse.The Dikky of the mouse has the space for the micro transmitter and cell", "PROS:", "WIRELESS RANGE IS FABULOUS", "SENSITIVITY IS PRECISE", "The mouse is compact,it has AUTOMATIC POWER SAVING which switches it off after 10mins of inactivity.Wen u shake it ,it starts automatically .", "There is a ON/OFF button.", "The mouse uses INVISIBLE LASER", "It is powered using DURACELL battery.", "Good for normal Gaming and stuff like browsing,photoshop,Counter-Strike etc etc", "Cons:", "It misses out the dpi button which allows it to change its sensitivity by click of a button. but thats just a minor disadvantage if ur a HARDCORE gamer.", "Conclusion: Buy if you are not a HARDCORE gamer. It gives comfortable experience for normal users.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  i used this mouse from last 10 day .. i also use hp mouse but i found this product more comfortable than any other.... grt feature... power efficient.. no red light in bottom so dont worry about it its fine.... on off button auto disconnect if lappi is not on....\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Awesome!", "May hand is reasonably big. Choosing a laptop mouse can be like finding a needle in hay stack.", "Dell mouse was recommended by a friend, although an earlier version. Based on his recommendation I went ahead with this one, of course after checking the dimensions.", "I like :", "1. nano receiver (Logitec and Microsoft also have it)", "2. dock to insert nano receiver within the the mouse. This is good. I had a logictec mouse, quite an old one which had a button like thing to fix its receiver at the bottom. It would detach itself in the bag calling for a search and rescue operation.", "3. On-Off switch (handy one). Some other brands also have it.", "4. Pretty good build quality (dropped from table once. Survived the fall)", "5. Easy to use -- My parents also manage to use it.", "6. Works well on Linux OS  (I use Linux Mint 15)", "Dislike...  nothing that I have come across yet !\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Close your eyes and buy it. Looks great. Clicks work very effectively. Pure plug and play and very handy. Works on one AA battery. On/Off button at bottom is very useful. USB connector is also very compact, is almost invisible when plugged in. Easy operation and worh it's price.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I received the DELL WM123 Wireless mouse,(as I was having DELL laptop) on 8th Sep 2014.It stopped working on 25 th Sep 2014. When I viewed the return policy,it is mentioned that return window closed on 20th Sep 2014. I don't know what to do, It worked only for 16 days. I tried with a new battery also. No ,it refused to work.I contacted Amazon, but I was told to contact Dell directly.The product is a Amazon fulfilled product.I was ordering all along with FLIPKART. But this time I wanted to give a try with AMAZON., as it was AMAZON fulfilled.(???!!!)Very very Bad.Dell people will be telling me to bring the product, this mouse. They may ask me to come for another day to know the status.I have to spend atleast five Lrs of petrol for my car and parking fee and all these things. I will be forced to spend not less than Rs500-00 for a product purchased for Rs564-00.  It will not be prudent to purchase anything from AMAZON. in FLIPKART the same product is priced at Rs 625-00 and is having a 30 day replacement guarantee.Ofcourse, I have not ordered with Amazon for the sake of Rs 61-00. Actually I wanted to give a try, otherwise I was very much satisfied with FLIPKART.I have made a childish attempt and learnt a lesson at a cost of Rs564-00.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Received today 14/10/14 as ordered on 09/10/14.", "PROS:", "Good/Smooth Performance.", "No laser light which saves battery consumption.", "Instant Connect.", "CONS:", "Little Heavy because of the Battery and you can't help it!", "Bulky Looks. Like old traditional mouse type look.", "VERDICT:", "If you are not aware of it ever:", "Wireless mouse doesn't use the Native Wi-Fi 802b/g/n Technology. It comes with a separate Wireless Adapter which just connects it's own device. Hence it got to have a dedicated USB Port all the time for the mouse to work.", "Laptop users having limited USB Port, would suggest to go for Bluetooth Mouse instead as it would save your USB Port for other uses. But remember Bluetooth Mice are prone to face disconnection issues often! Read reviews before making a purchase. Else USB Hub can be used but it makes the laptop little less portable...\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n\n\n\n", "\n  ", "\n", "\n\n\n      ", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Dell WM123 Wireless Optical Mouse"]},
{"rating": [], "price": [" 287.00", " 287.00", " 288.00", " 289.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Logitech's this mouse is quiet good for normal stuff, 3.5 stars but amazon won't allow half star ratings :/", "It is not heavy at all and works just fine.", "Recommended from my side for normal usage.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I was at first skeptical about this mouse as among few of my friends left click of its M100 counterpart stopped working. After going by its reviews on amazon.com I bought it with fingers crossed. But I have no regrets at least till now after using it for over a month. I will update if so happens in future.", "It fits the palm perfectly and is and is effective in its functioning. Its cord is quite long and will serve for all practical purposes.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Amazon packing & delivery were good. I bought this mouse for Rs. 280 a couple of weeks ago and now I see a drop down in price to Rs. 258/-. Initially I wasn't sure of buying this mouse as I've never used Logitech products before. This mouse is up to the mark. Recommended to all laptop and desktop users.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I would definitely recommend this product to everyone for daily stuff. I bought this mouse for Rs. 258 and you can't get better option in this price range. and come on its Logitech which is better than others like hp and dell.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  I bought this one month back and it's one of the best wired mouse infact by Logitech. I know this is also one of the smallest mouse I should say but there is another one which is smaller and better than B100 by Logitech company (in wired technology, good accuracy but quite old :-)), thought I bought that mouse but unfortunately got this mouse. the picture on the web was not clear when it comes to design but it's worth it with the price that I have paid. Good though.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Bought this mouse 2~3 weeks before and now the mouse is not working properly (cursor is not moving in my computer when I move the mouse). first, though that it can be related to any issues like conn-problem or perhaps my desktop is having compatibility problem(just wanted to rule out the possibility) but then I found the same problem existing when connected with an another computer.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Nice and decent mouse. Scroll button is a little tight. Design could also be changed for good as I remember to have owned one such ages back. Though the ball mouse is now a light sensor, the overall shape hasnt changed a bit over the years. Isnt it time for some change Logitech?\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  I've been using the mouse for the past week & it has been excellent.", "Packaging & delivery was decent.", "I found one thing annoying that the delivery person was constantly insisting me to pay by credit card whereas I had specifically said that I'll be paying by COD.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n\n\n\n", "\n  ", "\n", "\n\n\n      ", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Logitech B100 Optical Mouse (Black)"]},
{"rating": [], "price": [" 649.00", " 699.00", " 718.00", " 660.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  If you are looking for a wireless mouse at an optimal price, this should be the one. There are many brand, model at different price. I started sorting all items by Low – high price and tried to differentiate why I should be paying the difference for the next one. I considered the following while choosing this –", "Brand – It’s Logitech which can be trusted. If Logitech is selling a product, it must be getting the job done. I needed a good brand at least.", "Look & Feel – It doesn’t look fancy but very robust and a professional in terms of design and color. It looks good next to any kind of laptop.", "Price – Cheapest among the big brand. I didn’t feel the need for those differentiator for the higher range mouse", "After I used is for some time, here is my take –", "Efficiency – It’s a wireless mouse and it does the job efficiently. No lag or connectivity issue observed. I tried the mouse after it was idle for 12 hrs. and it responded instantly. There was some review feedback on this and the recommendation was Microsoft mouse over this. But I didn’t face any lag while using even after a long idle time.", "Look and feel – It’s robust, perfect size, good grip, optimal design. No noticeable issue at all.", "This is a good choice if you are looking for a wireless mouse at reasonable price for daily uses. in fact I couldn’t find a reason to go to higher end product in same line until and unless there is any specific requirement like laser pointing, different design (I personally liked the arch mouse which looks really awesome) or very fancy decoration (decorated skin).\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Works very well. Easy in the hand. Good optical response.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Amazon Service is good and also got the right product.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Nice Product and Delivered as expected time.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  very good mouse! delivers as promised\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  A simple, reliable mouse with wireless plug-and-play . good battery life.", "very easy to use and setup no driver or any installation required.", "I would recommend this to a friend,", "Go and grab this one !\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  it is working fine and smooth.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Prompt delivery! Good product.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Logitech B175 Wireless Mouse"]},
{"rating": [], "price": [" 650.00", " 738.00", " 781.00", " 690.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  the first product of Logitech I'd purchased were Desktop speaker and web cam 3 years back and they are still is prefect and now this wireless mouse...it is  like plug and play..no hassle..I wonder if Logitech comes out with Laptop also\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Never buy Any product fullfilled and shipped by Amazon. They have started over charging above M.R.P of the product. At the same time same product are avaiable 20% cheaper on the compititor portal.", "And to end everything they will only give you sorry. Amazon representative are not at all customer friendly. Not ready to listen to customer. And they never bother to loose a customer even when you have healthy purchase history.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  One of the worst products. I've received a USED OLD piece which has scratches at the bottom of the mouse and the LED tracking light doesn't work. I hate this from amazon as they dint do a quality check and wasted my valuable time and money.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Nice mouse for a laptop. But for desktop where you want the mouse to fit your hands its a bit small in size and you would want a bigger mouse. The connectivity is good battery life is good.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Mouse is good but the battery provided with it was not working. It was an old shipment. Please make sure everything is working if you are shipping an item in future.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Good product. There is a lag in this mouse but frankly I don't know if it's my computer or the mouse. Overt all I am satisfied.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Excellent product by Logitech. Very easy to handle and operate.", "Comfortable.", "Delivery could have been faster.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Its a good mouse to use with a PC or Laptop in this price range..I am satisfied with the performance.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Logitech B175 Wireless Mouse (Black)"]},
{"rating": [], "price": [" 135.00", " 119.00", " 175.00", " 134.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Nice Product,", "Its cheap and did well the job", "using it to connect my HCL laptop to samsung LCD,", "The connection is good and hassle free.", "Sound output is also good,", "the benefit of HDMI cable over VGA is that we dont have to plug any sound cord seperately,", "single hdmi cable is enough for both AUDIO and VIDEO", "the cord and connection sockets are of good quality, length is also sufficient.", "dont look after costly hdmi cables, i recommend this one\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Tried to connect my PS3 to my 42\" Plasma TV (panasonic). I was able to see the video, but there was no sound. Tried connecting my laptop to the same TV but i got nothing (no display/sound).\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  this product quality is npt so good please don't buy it. When I connected it to my amp amd tv, the tv kept flickering and couldnt recognize the signal so the picture was continuously distorted. whereas my other cables worked fine.", "invest a little more money and buy a decent one. also the length is quite small.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Didn't work at all. Waste of money.  I would recommend that one should test and then buy .. ( )\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Pros: Cable is good", "Able to connect to TV using Laptop, XBox", "Cons: Should have been little long, but may not expect that as I it is 1m mentioned on product..\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  This was by far the most economic offer. I still don't get why someone should be forced to pay", "thousand rupees for a simple cable. This offered correct price point.", "It was delivered on time. I watched few movies (incl. HD) from my laptop using this cable. It", "worked pretty well, quality remained same (playing in my laptop vs. projecting it to TV).\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Connected Laptop with LCD but did not work. Useless low quality product. Amazon should have quality check before promoting any product.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Quality of the HDMI Cable is very bad. it was not able to carry signals properly. I observed signal loss. It worked for only 3 weeks.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["HDMI Computer  EN0097VEM HDMI to HDMI Cable (Black)"]},
{"rating": [], "price": [" 449.00", " 449.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  The packing was really good.", "It has perfect fit and finish. A cute little and easy to use device.", "Cons: - For it to function, there should be at least 2 ACTIVE INPUT CONNECTIONS !.", "If you are thinking of using only one player/box connected to the output device(TV, Projector etc..) and want to keep others switched OFF, that is not going to happen by using this device.", "Please check other reviews too before you order.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  This is a great product. Simple and cheap. I read an older review that the switcher doesn't work very well with single \"ON\" device. That was ok for me since I planned to actively use two devices connected with the switcher. However, while actually using the switcher, I was in for a surprise. The switch works well, even if only one connected device is turned on. So, really, big thumbs up.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  The problem with this product is if you connect two device with this you always switch on both device  if you switch off one device it's not working.waste of money.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Its nice in the sense that we can connect 2 devices and do not have to plug/unplug the HDMI cable every time to switch. You just press the button on this device to switch from one source to another. One thing that could be made better was if there was a small remote(maybe I am being too lazy :) ) It would have added another remote to take care of though, For the price, its not bad!\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Works fine for the price paid. Only point is there will be 4 HDMI  cables originating from it from four directions which will take some space and other point is lack of remote control. If u have less device this is perfect. Also, if u switch on a particular device it automatically shows that device only irrespective of the position of HDMI  slot.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  This was inexpensive but we have been using it for several months with no problems. We have only two HDMI ports on our TV, and four things to plug in, so this was a good solution, much easier than unplugging things all the time to plug in something else.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Really good..It works well with my PS3 and the Tata Sky box\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  i bought this along with chromecast, and it just works perfect.", "Very cheap as well.", "(did think a about canceling the order after reading the other person's review saying he couldn't get chromecast to work)\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["3 Port 1080P HDMI AUTO Switch Splitter Switcher HUB Box Cable LCD HDTV"]},
{"rating": [], "price": [" 745.00", " 750.00", " 699.00", " 599.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  All buyers, Ensure that you are getting Genuine Samsung Bluetooth headset, Recently I got fake Samsung HM1100 Bluetooth headset.", "For first time buyers, it is difficult to identify, but as I already purchased Genuine HM1100, 3 times, so I know how is the performance of Genuine item.", "1). First of all, Genuine comes with proper Invoice with manufacturer warranty (not seller warranty)", "2). Identify the Box Hologram, if available, it will describe Samsung Original, In Genuine one, Original will not be written", "3). Inside box, Samsung is provding User Guide also, In fake one, you don't get this", "4). In Genuine, You will get two Hooks, but Fake will provide only one hook", "5). Body finishing of the BT headset will be very fine in Genuine, but fake one will be little bit rough, specially microUSB plug.", "6). Battery backup of Genuine one will be aroud 4 to 7 days of normal usage (night switched off)", "7). Sound quality will be very good in Genuine one", "8). Power ON OFF button shows red color when in Off position in Genuine one, but no color in fake one.", "9). Fitting of the Genuine headset in plastic cast will be finely engineered fitted, but fake one is not designed in that way and strength of this plastic cast will be very weak.", "10). Check that, in fake one, there may be a rubber over earpiece", "Above points are my experienced ones, you may discover other type of fake points from other fake resources", "it may help someone who just bought a fake and still has a chance to return it. If everyone returns fakes to the sellers, they'll eventually stop trying to sell us this junk. You might think, \"Hey it's cheap, it looks real, and it works...why not buy one?\" Sounds logical but what happens if it dies in a month after you get it? Whose warranty covers it? The seller? Samsung? Nope. Who's gonna fix it? No one. Spend a little extra and get the real deal.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  1.The name SAMSUNG written on the device shows as it is duplicate (it is not SAMSUNG's style of letters).", "2.To check the battery level (press and holding volume down & talk button) is not working as per product manual which is downloaded from samsung site(this product is not shipped with manual).", "3.The sealing of front & back cover is very poor(gap between these 2 parts). due to this poor sealing, when indicator blinks, the light beams are visible between front & back coder gaps near volime up & down buttons.", "Please don't cheat the customers by shipping duplicate products\n", "\n\n\n\n", "\n\n\n\n\n\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Purchase this item if you are looking for cheaper and better product. You can use only for telephone calls and not for music. Shipping is very fast. :)\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Surprisingly I found charger inside box and I did not get any product description from SAMSUNG inside it;", "Then went and check for the Genuiness of product; I surprised to found it is fake product  and Now trust on Amazon is big question\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  General comments:", "It's an on-the-ear headset. It supports just an ear loop (1 extra in package). It does not have foam for moulding into ear canal, and hence the loop is the only way to suspend it from the pinna.", "Build:", "The ear loop is a fragile thing and probably easily breaks, a typical scenario being turning over in bed to rest your head on it.", "Sound volume and clarity:", "Sound is clear, but seems not loud enough. One can just hear what's spoken, at maximum volume. Also one needs to speak loudly for it to be heard at the other end. So not the type of headset you want to use while talking to your beloved, at night.", "Features:", "It has a lot of features not usually present at this price point. Volume controls, On-off controls are usually not seen in headsets of this range.", "Call time:", "More than 4 hours, which is great and the only good feature about this cheap headset.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I am using it for my iPhone5; Voice clarity is good; Battery life is very good; it's value for money buy.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I like the service of amazon. product is good but sometime i feel pain in my ear while using the device. I think you cant use this for long time. I suggest use this device only during driving.", "Thanks", "Krishna\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  the product is good and reliable.Best in its range,easy to use.I don't see the reason why i need to enter a minimum number of characters for this review.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Samsung HM 1100 Bluetooth Headset without Charger (Black)"]},
{"rating": [], "price": [" 199.00"], "comments": ["\n    ", "\n", "\n            \n          "], "title": ["T-link USB Optical Mouse Black T-008"]},
{"rating": [], "price": [" 149.00"], "comments": ["\n    ", "\n", "\n            \n          "], "title": ["T-link ps2 Optical Mouse 800 dpi 3 Buttons - Black"]},
{"rating": [], "price": [" 4,499.00"], "comments": ["\n    ", "\n", "\n            \n          "], "title": ["Spice Stellar 445, Jelly Bean, 4\",Quad Core,Quick Charge Feature,Local Languages"]},
{"rating": [], "price": [" 4,899.00", " 5,499.00", " 5,999.00", " 4,990.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Xolo A500S IPS is a budget Android under 7K device. This phone is same as the Xolo A500S,the only difference being the screen.This has a better IPS screen.Old one came with a TFT screen", "-> Key Highlights,Pros and Cons", "* Well designed.", "* Mediatek MT6572W Dual Core processor - Decent processor,performance-wise not as good as mtk6589 quadcore.", "* 512 MB Ram - Enough for your basic apps usage,but not great for gaming and multitasking.", "* 480 x 800 pixels, 4.0 inches (~233 ppi pixel density)- Pretty decent for the price.", "* Viewing angles are OK,not that great", "* Dual Sim", "* Camera - Average quality, nothing to be excited about.Expect some blurry images often. Front camera can be used for video calling in well lighted areas only.", "* Music quality coming out of the speakers is not good.Headsets coming with the phone is of average quality.", "* 3G Speeds - 21.1 Mbps HSDPA; 5.6 Mbps HSUPA", "* Operating System - Android OS, v4.2 (Jelly Bean),not the latest version,but visually there isnt much difference from 4.3 or 4.4 Android.", "* Battery - Li-Ion 1400 mAh battery - Not great. It cant even last a day. (2-3 hours screen on time with wifi/3g data on).", "* Performance and Gaming - The processor and gpu on board is capable of playing basic popular games like Temple run,Subway surfers etc.But expect lags if you have a lot of apps installed and they are occupying the memory.", "Verdict - This phone is good if you are planning to use only a few apps,like Whatsapp,Facebook etc. Dont buy this for using high end apps, gaming or for camera performance.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Pros :: its been a month and till now all good, i'd like to give suggestion on cons. as pros you guyz know.", "Cons :: 1) camera is not actually 5megapixel, Led is useless, still i'am satisfied with the quality of the product ( better than average )", "  2) RAM is not actually sufficient but if you want more than than go for higher range mobiles.", "  3) Games do lag sometimes.", "  4) battery is good, depends upon the usage as for my view every android needs to be recharged once per day so no big issue.", "Low on budget, go for it, best you can get in this range.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  This is a very good phone and value for money. Only reason for giving 3 stars and not 4 is, the overall sound quality is not good. It cannot be used as a mp3 player while traveling. The speaker volume for mp3 music ringtones is also low, and if TV volume is moderate the incoming call may not be audible. The incoming call ringtone volume issue may not be applicable for the inbuilt ring tones as they were pretty loud.", "I like this phone. If they work on the sound issue, i will definitely buy the next iteration of this phone.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I received it yesterday and planned to write a review after using it.", "I haven't seen any lag even while playing games like Asphalt, Subway surfers.", "Battery backup is also good:", "I charged it fully once and been using it with above moderate usage, 1hr gaming, 1hr whatsapp, few calls and browsing.", "So, you can easily get a day of backup, with moderate usage", "Only concern is Android 4.2.2.", "It would be nice, if Xolo releases updates.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  XOLO A500 IPS MOBILE NICE MOBILE BUT SOME DEFAULTS ARE THERE.BATTERY IS NOT GOOD.4GB INTERNAL MEMORY NOT AVAILABLE.BUT IN LOW PRICE SMART MOBILES THIS PRODUCT IS GOOD.SAMSUNG S DUOS ALL OPTIONS ARE THERE IN THIS MOBILE\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Good phone in budget price. overall good performance. security feture is good. only Camera quality is not upto the mark. overall good experience.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Phone puchased online through amazon.in this month. Received delivery before the specific date mentioned. Though the phone is being used by my son, I come to know that the same is worth considering its cost and is functioning well. My son is fully satisfied with the phone service so far from the date of its receipt. The clarity and camera of the phone is marvelous.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  this is perfect match for me, its giving long battery backup even 5 hrs continue browsing, better video resolution, once phone memory getting 70% full , phone is slightly hanging, so i removed 20% then no hanging problem, the worst issue is the charger its take too long to battery full, i tried with other charger its quickly charging, overall i can give 7 out of 10\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Xolo A500s IPS (Black)"]},
{"rating": [], "price": [" 1,365.00"], "comments": ["\n    ", "\n", "\n            \n          "], "title": ["Spice Boss Marathon 3 M-5362 (Black)"]},
{"rating": [], "price": [" 1,069.00"], "comments": ["\n    ", "\n", "\n            \n          "], "title": ["Spice Boss Trendy 5 M-5032 Grey+Silver"]},
{"rating": [], "price": [" 26,695.00", " 26,950.00", " 27,694.00", " 26,999.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I was always fond of photography, but never could afford a DSLR. So tried very hard to get the most out of my point and shoot for years. Well, after saving bit by bit, I bought this camera and this feels something which I can't express in words. I bought it from Amazon because the price was about 3K low than other online stores. I must say this product is an absolute beauty and will bring smile to your face after every shot.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  The 1 star is for the product description.", "I made the purchase on 8th of june and when the return period expired the camera charger stopped working.", "The information on amazon says 2 years of warranty, but the service card and Nikon say no coverage for any accesory.", "Apart from this here is a mail from Nikon Service", "\"Dear Mr. Agarwal,", "Thank you very much for writing to us.", "In reference to your query, we like to inform you that accessory such as charger are not covered under warranty and the same is mentioned on warranty card as well.", "Moreover, Nikon India do not deal in online sales and Amazon is not an authorized dealer of Nikon India.", "Thanks & Regards,", "NIND SUPPORT\"", "Say it as my bad luck or what, but now i would have to shell out 2.5k more for the charger.", "Thanks a lot Amazon for this.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I gave a lot of thought while choosing a beginner DSLR and shortlisted two-one from each of the biggies. Canon 600D and Nikon D3200. Each has its own advantages and finally I came up with a few things that I felt are really significant. Here they are!", "1. Nikon's C-MOS is around 10% bigger than Canon's, It's just enough to understand that sensor is equivalent to film in the yester year cameras and the bigger the sensor, the more the detail and better the image.", "2. Nikon has got more Megapixels. Don't get me wrong, One of the best and costliest cameras Nikon D4 has got a sensor resolution of (only?) 16.2 MP and I don't dare say that D3200 is a match for it. I'm just saying that bigger sensor and better resolution in D3200 compared to 600D (esp when we do a lot of cropping) inclined me towards it.", "3. D3200 has more auto-focus points (11 vs 9) that aid in better tracking in AF-Area dynamic mode, has slightly better frame rate (4 vs 3.7), much lesser start up time, better weighs lighter.", "4. Auto-focus during video recording.", "5. Most importantly Nikon has a much cheaper price tag.", "1. Canon 600D has articulating LCD screen means that the screen isn't fixed-very useful when using Live mode when subjects is at low/ ground level. Nikon has a fixed one.", "2. Canon has found to deliver better performance at really high ISOs (less noise) as per one website which I religiously follow but nevertheless I rarely use really higher ISOs so as to pick on the noise.", "3. Canon has in-built auto focus motor but many of the recent Nikkor lenses come with foucs motor, so I didn't feel it's such a big issue.", "4. 600D has a better LCD screen, it better resembles the final image and also a bigger viewfinder.", "I weighed my choices and finally went ahead with Nikon and it never disappointed me.", "Finally I was really awed by Amazon's packing!\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  This is my first review ever. So please bear with me!!!", "Ordered on the 6th of June and got it on the 10th.", "Here's the timeline", "Amazon carefully packed it with airbags to prevent it from coming to any harm as the lenses and the camera very prone to damages in transit. FedEx did an exceptional job delivering the package.", "Opening the outer box you would be drawn to the camera box and the beautiful leather bag in it.", "It took me a while to find the 8gb memory card which was taped on to the side of the camera box. So you need eagle eyes!!!", "The box was sealed with the Nikon logo and on opening you will find the camera, len and other accessories neatly packed in air bubble packs.", "If you are a novice to the world of photography, I suggest read the manual and go through the instructions before operating the camera.", "Coming to the camera its really compact in size and offers a beautiful display of 3inch. Since I am writing this review after only a day I am not able to access all the features of the camera but by reading the manual I clicked some good shots.", "A prime lens and a 70-300mm is what you will be needing in the future. Till then keep clicking.", "Don't forget to validate your warranty card in the Nikon Authorised Service Facility for your 2 yrs warranty.", "Amazon offers this product at a price lower than other online sites. At least that's what I got!!!", "Thanks for reading.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I would like to say something to all online buyers. I have taken 1 month to enquire about DSLR cameras and there was Rs.3000 price difference between online and outside dealer(Online cheap). When I enquire at outside dealers about Nikon D3200 DSLR camera, they said many false information about online product. They said that, online product wont be eligible for Nikon warranty and they will remove the original battery and assesories, etc. I did 1st thing after I receive Nikon D3200 from Amazon that, Have called Nikon customer care and provided the serial number of my Camera. Thay said that its genuine product and its eligible for 2 years India warranty. I have received the camera box as sealed pack and all the assesories are original. But I disappointed with the Camera Bag which could be some more quality.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Nikon D3200 24.2 MP Digital SLR Camera (Black) with AF-S 18-55mm VR Kit Lens, Memory Card, Camera Bag"]},
{"rating": [], "price": [" 436.00"], "comments": ["\n    ", "\n", "\n            \n          "], "title": ["Olo Simple OLO024440 Case for Samsung Galaxy S3 (Crystal Blue)"]},
{"rating": [], "price": [" 37,450.00", " 35,950.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I was always fond of photography, but never could afford a DSLR. So tried very hard to get the most out of my point and shoot for years. Well, after saving bit by bit, I bought this camera and this feels something which I can't express in words. I bought it from Amazon because the price was about 3K low than other online stores. I must say this product is an absolute beauty and will bring smile to your face after every shot.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  The 1 star is for the product description.", "I made the purchase on 8th of june and when the return period expired the camera charger stopped working.", "The information on amazon says 2 years of warranty, but the service card and Nikon say no coverage for any accesory.", "Apart from this here is a mail from Nikon Service", "\"Dear Mr. Agarwal,", "Thank you very much for writing to us.", "In reference to your query, we like to inform you that accessory such as charger are not covered under warranty and the same is mentioned on warranty card as well.", "Moreover, Nikon India do not deal in online sales and Amazon is not an authorized dealer of Nikon India.", "Thanks & Regards,", "NIND SUPPORT\"", "Say it as my bad luck or what, but now i would have to shell out 2.5k more for the charger.", "Thanks a lot Amazon for this.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I gave a lot of thought while choosing a beginner DSLR and shortlisted two-one from each of the biggies. Canon 600D and Nikon D3200. Each has its own advantages and finally I came up with a few things that I felt are really significant. Here they are!", "1. Nikon's C-MOS is around 10% bigger than Canon's, It's just enough to understand that sensor is equivalent to film in the yester year cameras and the bigger the sensor, the more the detail and better the image.", "2. Nikon has got more Megapixels. Don't get me wrong, One of the best and costliest cameras Nikon D4 has got a sensor resolution of (only?) 16.2 MP and I don't dare say that D3200 is a match for it. I'm just saying that bigger sensor and better resolution in D3200 compared to 600D (esp when we do a lot of cropping) inclined me towards it.", "3. D3200 has more auto-focus points (11 vs 9) that aid in better tracking in AF-Area dynamic mode, has slightly better frame rate (4 vs 3.7), much lesser start up time, better weighs lighter.", "4. Auto-focus during video recording.", "5. Most importantly Nikon has a much cheaper price tag.", "1. Canon 600D has articulating LCD screen means that the screen isn't fixed-very useful when using Live mode when subjects is at low/ ground level. Nikon has a fixed one.", "2. Canon has found to deliver better performance at really high ISOs (less noise) as per one website which I religiously follow but nevertheless I rarely use really higher ISOs so as to pick on the noise.", "3. Canon has in-built auto focus motor but many of the recent Nikkor lenses come with foucs motor, so I didn't feel it's such a big issue.", "4. 600D has a better LCD screen, it better resembles the final image and also a bigger viewfinder.", "I weighed my choices and finally went ahead with Nikon and it never disappointed me.", "Finally I was really awed by Amazon's packing!\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  This is my first review ever. So please bear with me!!!", "Ordered on the 6th of June and got it on the 10th.", "Here's the timeline", "Amazon carefully packed it with airbags to prevent it from coming to any harm as the lenses and the camera very prone to damages in transit. FedEx did an exceptional job delivering the package.", "Opening the outer box you would be drawn to the camera box and the beautiful leather bag in it.", "It took me a while to find the 8gb memory card which was taped on to the side of the camera box. So you need eagle eyes!!!", "The box was sealed with the Nikon logo and on opening you will find the camera, len and other accessories neatly packed in air bubble packs.", "If you are a novice to the world of photography, I suggest read the manual and go through the instructions before operating the camera.", "Coming to the camera its really compact in size and offers a beautiful display of 3inch. Since I am writing this review after only a day I am not able to access all the features of the camera but by reading the manual I clicked some good shots.", "A prime lens and a 70-300mm is what you will be needing in the future. Till then keep clicking.", "Don't forget to validate your warranty card in the Nikon Authorised Service Facility for your 2 yrs warranty.", "Amazon offers this product at a price lower than other online sites. At least that's what I got!!!", "Thanks for reading.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I would like to say something to all online buyers. I have taken 1 month to enquire about DSLR cameras and there was Rs.3000 price difference between online and outside dealer(Online cheap). When I enquire at outside dealers about Nikon D3200 DSLR camera, they said many false information about online product. They said that, online product wont be eligible for Nikon warranty and they will remove the original battery and assesories, etc. I did 1st thing after I receive Nikon D3200 from Amazon that, Have called Nikon customer care and provided the serial number of my Camera. Thay said that its genuine product and its eligible for 2 years India warranty. I have received the camera box as sealed pack and all the assesories are original. But I disappointed with the Camera Bag which could be some more quality.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Nikon D3200 24.2MP Digital SLR Camera (Black) with AF-S 18-55mm VR Kit and AF-S DX VR Zoom-NIKKOR 55-200mm f/4-5.6G IF-ED Twin Lens 4GB Card, Camera Bag"]},
{"rating": [], "price": [" 34,950.00", " 35,500.00", " 33,500.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I  got a good deal on this product from Amazon. I never intended to buy a DSLR but looking at the deal posted on amazon just tempted me to.", "Had initially planned to buy a small point and shoot camera but then bought this one.", "Must say I'm quite happy and the product  is good and you can close your eyes and blindly go for it. It's a product for beginners and will ignite your passion in photography!\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Very new and good in functions. 'Amazon\" amazing because I had given them my name, phone nmbr and city, lane & State P.O. with this including and HUD HUD entered in between (from 6th to 12th October-14 ) the item reached my hand on 17th. I thank u all. My office - Labour Commissioner, Assam that I forgot to include in my address.The product is fulfilled to my desire. It's picture is very lovely and lastly I should say, with this Rs.19950, 1 Pc  8 GB SD + 18-55 VR lens + a bag, it is out of dream. I repeat the details of camera specification is rightly quoted. Actually the specifications encouraged me most. If such occasion arises I shall be with NIKON.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  This is first camera I have ever bought. I would like to review this in two parts.", "1.Delivery : 5 of 5", "2. Product: 5 of 5", "I have bought this DSLR last week and cannot get hands of it. I ordered product in the morning and got the delivery by evening with good packaging.", "Regarding the product, you wont get better camera for starters that this one.", "as mentioned earlier this is my first camera and still learning to use this. The package consists of body, lens, battery, bag and few accessories...", "Picture quality is good.", "works as it should, in short.... All is well...\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Its an amazing product... Delivered before time.. Amazon packing was excellent and very safe for a sensitive product like this.", "The camera is worth buying..\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  This product when compared to D3200 is not that clear, D3200 comes with 24 MP and that's the best buy  for the fact it cost just Rs 2000.00 more approximately\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Amazon has done a perfect delivery with great quality..", "Packaging is really damn good..", "1. Camera quality and all accessories are good.", "Its good for beginners and NIKON provides session based training for beginners.", "cons:", "Water proof bag is not provided to carry and use with out worry especially in Bangalore.", "Can give 16 GB memory card instead of 8GB.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I bought this for gifting it to my husband and he loved it all over!!!! Amazing Product\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  I love this camera very much. Best buy at this price range. seller is very good, got this at best deal. ordered for the 50mm prime lens today from the same seller to get better bokeh effect. i am just a learner of DSLR, and its just best for me. Dont think much, just go for it.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Nikon D3100 14.2MP Digital SLR Camera (Black) with AF-S 18-55mm Nikkor VR Kit and Nikkor AF-S VR 55-200mm f/4-5.6G Zoom IF-ED Twin Lens, 4GB Card and Camera Bag"]},
{"rating": [], "price": [" 499.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  The glass is wobbly and you have to be cautious when cleaning it.", "Dont fit this directly on the lens as its threads may damage the lens. Always use a filter on the lens and screw this to the filter.", "Also this comes in a very shabby case which is not good in quality. I have stopped using it as its oily inside. So everytime you put back the filter in the case the glass will get all oily and you have to clean it again.", "But when cleaned and fitted on a filter the closeup filters work as desired and I am happy with the results.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  This filter kit is rocking.  It gives you a new way to a creative photography i.e. macro photography.  With so less time I experienced few great things that normal lens cannot do.  Product was nicely packed and quickly delivered.  I got this at 299/- and I think with so less investment you can create a different world with your existing lens.  Works best with my 18-55 canon lens.  Please use a clear filter before mounting this kit as it has sharp edges and can damage your 10K plus lens front.  Seller is really cool and delivers fast depending on your location of delivery.", "Thanks.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Filter kit pack is simply fantastic. I used each of them for closer shoots and the results were very distinctive. Would recommend this as a must add-on for DSLR.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  didn't try other filters", "but macro filter is good.", "offcourse, don't compare it with the macro lens. but still the good results.", "one suggestion for camera owners, while clicking pics thru macro, change focus to manual mode, then zoom it to your requirement and then focus it manually, you will get good results.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Great product at this rate. Highly recommended.", "Obviously you can't compare it with expensive macro lenses but it surely give me wonderful result.", "And it's much more better than reversing lens and spoil expensive lens.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  For those who can;t afford a Canon Macro or don;t want to spend that much yet these are fun substitutes. With the 18-55 lens the combinations give good results. I have yet to get a complete feel of the set but from the initial shots I am thrilled. The close ups are really good. They do give one the satisfaction of having come closer to the perfect Macro shots.", "The finish of the product is OK for the price. Bit 'crudish'' if I may use the term. But then it's the result that matters and I am happy with them.", "Delivery of the product was within the time limit and the Items are as expected.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  fits nice", "saves money by not investing in a macro lens for just 'trying' macro photography people", "clear lens..recieved in a roll fold bag..just apt for storage\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Out of all the 4 lens, one lens glass was simply placed in the frame. These are raw glass pieces placed in rings and being sold as lens. I know price is very low but what use is a lens with wobbling gladd\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["SPE 58mm Lens Filter Kit for Canon EOS EF"]},
{"rating": [], "price": [" 1,020.00", " 1,240.00", " 1,468.00", " 849.00"], "comments": ["\n    ", "\n", "\n            \n          "], "title": ["Trriger PS2 Value Pack Controller + 16MB Memory Card-Black"]},
{"rating": [], "price": [" 749.00", " 449.00"], "comments": ["\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    \n        \n    \n    \n\n\n\n\n\n\n\n\n\n\n\n", "\n\n[{"rating": [], "price": [" 1,049.00", " 1,067.00", " 1,068.00", " 1,045.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  i checked keyboard and mouse in my office from 15 foot distance and also from other cabin also work so,", "this is very very very nice wifi range and auto shutoff system for battery life , when you not touch mouse and keyboard for 30 second they they automatic shut off so BATTERY SAVING mode automatic activated after 30 second.", "- keyborad stock is very very smooth, not like microsoft and iball but compare to other keyboard this is MAKHKHAN", "- keyboard up key is very small otherwise all key are good.", "- very small and with FN (function key) for space saving keyboard and giving all function with this key like", "  HOME, EMAIL, SEARCH, CALCULATOR, MUSIC ,BACK, PAUSE, NEXT, MUTE, VOL DOWN , VOL UP, PRINT SCR, &  PAUSE/B.", "-  come with 2 AA battery pack and 2 AAA battery pack and both are premium GP ALKLINE BATTERY PACK.", "-  mouse working on my office table without mouse pad.", "-  go for this and save your space on table in this type of small and powerful ranging keyboard you not finding in any other brand in 1000 rs.", "thanks amazon very very very fast delivery and very very nice 3 layer packaging. i think packaging coasting is nearly 50 to 70 rs. so thats about BEST SERVICE FROM AMAZON.", "AMAZON TRACKING UPDATE WITH SHARP TIMING ON SMS AND EMAIL BOTH .SO TURN OFF YOU EYES GO FOR AMAZON.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Pros:", "Keyboard is sturdy, small form factor.", "Pre-defined volume control keys. Function keys can be customized using Logitech SetPoint software.", "Full sized mouse with invisible optics.", "Customizable mouse middle button (via SetPoint).", "No visible LEDs in mouse or keyboard to save battery.", "High DPI mouse, better that cheaper wired variants.", "Relatively longer battery life, as compared to other brands.", "Highly suitable for students, internet users, casual gamers.", "Saves desktop space.", "Cons:", "Mouse battery cover is a little loose. Cover opens up when is used on rough surfaces, like on fabrics or rough denims.", "Both mouse and keyboard lacks on/off switch. Battery is to be removed to turn off mouse or keyboard.", "No status indicator LEDs on keyboard. SetPoint software is to be installed for OSD and battery level indication.", "The keys at the edges (function keys and arrow keys) are too crammed.", "Not suitable for heavy use or hard-core gaming.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Delivery experience is good, I have opted for standard delivery, they tried to deliver on 3rd day but did not find the address, delivery person called me on 4th day and found the address and delivered it.", "About the product, Logitech MK220 Keyboard is not up to my expectation, the disappointment is that the key board and mouse have no power button(s). Once we load the batteries we do not have control on the power and the gadgets. on the key board it is mentioned about 'Auto sleep' but not sure how efficient it is. In spite of keyboard's Auto sleep feature, I feel the power control button is very important to control the function of the key board especially to avoid interruptions due to unintentional press/moves, same with the mouse. The key board layout is very tight, of course it is compact but it is little uncomfortable when to deal with the buttons on the edges. And unlike other branded mouses, the Logitech mouse needs two AA batteries.", "Overall its not a great product but if you are not so concerned about power buttons and the compactness of the keyboard, you may still go for it.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  ADVANTAGES:", "*key board functions good as the keys are very easy to type", "*small size of keyboard looks handsome", "*mouse have a good weight and is very user friendly", "DISADVANTAGES:", "*key board and mouse works only when it is only very close to the reciever", "other mouses (adwick) can even works at distances", "*no indicators to check the activation of CAPS LOCK, NUMBER KEYS so it makes difficuilties in typing passwords", "*invisible optical to check mouse\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Near perfect compact wireless Keyboard. Soft, silent, well positioned keys with good tactile feedback.Function Keys in the top and up/down, Left/Right arrow keys made smaller to achieve compactness. Should not matter for most users and if it does matter to you, look elsewhere and not a compact Keyboard.", "Ergonomic mouse that feels natural to hold with smooth cursor movement. Smooth scroll wheel. Comparable to the good performance of the much costlier MK305 wireless mouse ( which I have been using for many years.)", "2.4 GHz wireless connectivity. In my environment worked fine with no connectivity issues.USB receiver could have been a little smaller. ( The USB receiver of my MK305 mouse is much smaller and hardly comes in the way when packing the laptop.)", "Plug and Play. For added features users can download and install the Setpoint software. (free).", "Overall, for the price it is an an excellent , compact, lightweight KB and mouse to carry with the laptop. 3 years Logitech warranty. Can't ask for more.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Product is good and delivered quite quickly in very good condition. Mouse is very good to operate but keyboard is not. Keys are very small and closely placed. Need lots of practice to press the right key otherwise you end up in pressing multiple keys and sometimes wrong key. I would recommend to use a full sized keyboard like desktop keyboard and not this one.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Logitech MK220 Wireless Keyboard and Mouse Combo (Black)"]},
{"rating": [], "price": [" 8,995.00", " 8,995.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I bought this watch from Amazon.in recently.", "I should say that this is the best watch one can get if they are looking for a BIG watch which has good looks.", "It is Bold,descent, stylish, Big, and sexy.", "I bought it from XL retain (seller name). The price was very low when I bought it and it was a 100% genuine item with clean packing.", "I recommend buying this watch from Amazon.in\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  My ambition to wear a FOSSIL watch was ended after i received this product from AMAZON.", "some points :", "1)The watch has a big dail (50mm).", "2)Easy to read time and stopwatch(chronograph).", "3)Good for big persons.", "4) would be good if Chronograph hour hand is included instead of 24 hour hand.", "5)Numbers shine(radium) at night.", "6)2 year manufacturer warranty.", "If u want 100% genuine watches, purchase in AMAZON,WATCH CART,ETHOSWATCHES,FLIP CART....other wise their is a possibility of Fake watches delivered to u.(EBAY is selling Fake watches).This is my personal experience .Pls do share.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Awesome watch...big dail\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n\n\n\n\n", "\n\n  ", "\n\n  ", "\n\n  ", "\n\n\n\n\n", "\n  This is the most fun I have had for around a hundred twenty bucks! It is heavy but amazingly comfortable. Nothing gouging me. The display looks like a wall clock. I love playing around with the chronograph. I can actually read the three sub-dials clearly. The date window is a bit small. If this had been addressed the watch would have received 5 stars. It is massive and impressive. Fit and function is stellar for a watch in this price range. Even the second hand is aligned with the ticks around the dial. I just love it. Lots of character. As I drove home I looked down at the bezel and realized it rotates! I thought it was fixed. This means I can time my student's class assignments with ease. Great for a science teacher that can use a readable chronograph watch. I'll leave my Citizen Skyhawk at home from now on.\n", "\n\n\n", "\n\n\n\n\n", "\n  I've owned Guess and Kenneth Cole watches. I was looking at the citizen watches but came across this Fossil JR1353 Nate series. Very inexpensive compared to citizens and others. Its a big watch however I'm a big guy so it only makes sense to get a big watch...=). I needed an extra link and Fossil will send you 2 free links.", "For the price, you can't go wrong. Saves you a little to go and get another in a couple years to stay with the trends. I take care of my watches so I'm sure this will go for several years. With an 11-year warranty and great things I've heard about their customer support, you can't go wrong with that either.\n", "\n\n\n", "\n\n\n\n\n", "\n  The watch is nice and sturdy. I just got it, but it looks long-lasting. It is just like the pic on Amazon and it is certainly big if that is what you are looking for. For the price, it is a remarkably beautiful watch.\n", "\n\n\n", "\n\n\n\n\n", "\n  I don't know where you can find this level of quality for such a low price?? This watch is SOLID; very heavy when you first pick it up. This is a watch that was made the RIGHT WAY! Very pleased.\n", "\n\n\n", "\n\n\n\n\n", "\n  if you like big watches, this is the most beautiful that exists. I bought this watch and I am extremely satisfied.\n", "\n\n\n", "\n", "\n\n      ", "\n        \n      "], "title": ["Fossil Nate Chronograph Black Dial Men's Watch - JR1353"]},
{"rating": [], "price": [" 4,080.00", " 4,080.00", " 4,037.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  She always wants me to have some beautiful wrist watch, She had selected this one for me & gifted to me. I am very happy with this watch. Same as described no deviation.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Very good and decent look prominent in wrist. Good price deal as compare to market price.", "Also good delivery by Amazon\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Fabulous. Same as shown in picture. Delivered on time.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n      "], "title": ["Casio Enticer Analog White Dial Men's Watch - MTP-1300D-7A2VDF  (A485)"]},
{"rating": [], "price": [" 3,152.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n", "\n  Amazing very very nice watch. Ordered it for my daughter and she loves it.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  nice wach\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n      "], "title": ["Gio Collection White Dial Women's Watch - GLC-4001FP (10652)"]},
{"rating": [], "price": [" 3,225.00", " 3,225.00", " 3,395.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n", "\n  amazing site good customer supports . . .\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Ordered this watch to gift for diwali since they have mentioned the price as 1000rs after 2 days cutomer service called back to tell that there was a error in price it is supposed to be 3000rs well in US its a law that, once placed the ordered it should be dispacted to customer .Not sure about india.PLEASE AVIOD SUCH ERRORS THAT TOOOO IN THE SITE LIKE AMAZON.I did ordered timex watch 1 weeks back for diwali which was dispacted on time but DEFECTED one strap attached to dial was broken .Now i need to spend few more hours to search and order new item and definetly am not going to spend time in amazon .", "Thanks\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n      "], "title": ["Casio Enticer White Dial Women's Watch - LTP-2069L-7A2VDF  (SH62)"]},
{"rating": [], "price": [" 25,299.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n", "\n  Good watch, but this is the less featured Ambit2 R. Heart rate monitor is NOT included in box. GPS is a fantastic feature, and battery life is good too. It can give you around 8 days on full charge, provided you use the GPS sparingly.  However, the screen is a bit of a letdown, as contrasts are not so good, which means blacks aren't very black and whites aren't exactly white. However, one awesome feature is the ability to swap screen contrasts - it can be black letters on white or white letters on black background. I haven't used the sports features extensively, or the HR feature, but distances seem to be accurate. The speed seems to be a bit off. Overall, a pretty good watch for the price, and it looks good too. If it had Core like dimensions, it would have been fantastic.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  This model is ambit2 R HR but picture shown is for w/0 HR. also MRP mentioned is wrong..however watch is nice\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n\n\n\n\n", "\n\n  ", "\n\n  ", "\n\n  ", "\n\n\n\n\n", "\n  All the advertised specifications were true to their word.  The battery life is spectacular on standby mode.  This watch was still at 70% battery power after 2 weeks of non-use.  As per the navigation features, though you need to make routes online, you can still set up POI's and it navigates to them perfectfly.  The SIRF IV chip inside it is perfect.\n", "\n\n\n", "\n", "\n\n      ", "\n        \n      "], "title": ["Suunto Digital Black Dial Unisex Watch - SS020654000"]},
{"rating": [], "price": [" 3,415.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Good Watch......\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n      "], "title": ["Maxima Attivo Chronograph White Dial Men's Watch - 25951LMGB"]},
{"rating": [], "price": [" 8,545.00", " 8,995.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n", "\n  OSM watch... believe me it is not looking that much good as it is.Images uploaded by amazon are quite dull..but these watches looks really osm...very stylish, solid build, and catchy design...the only minus point is ...you should need to be little careful regarding its glass and dial...as it can get scratches very easily...else there is no issue...so happy shopping guys..\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Excellent product to enhance the manly style and charm. The seller response and delivery was swift and the product came with a VAT paid bill and Duly stamped warranty card. I would love to recommend this product and seller for all watch enthusiasts.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Must have for professionals. Absolutely value for money, superb service delviery from Amazon. Got it completely sealed with invoice, stamped warranry card, hologram on watch + good discount.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n\n\n\n\n", "\n\n  ", "\n\n  ", "\n\n  ", "\n\n\n\n\n", "\n  Love this watch...was a bit hesitant in the beginning as some people have said that this is quite heavy...but its OK & not that bulky...for all those who love bigger dials wd be used to such a weight...excellent product at this price point compared to what similar styles wd cost you from other reputed brands...nice watch with reliable technology & brand...must say it looks classy as well...\n", "\n\n\n", "\n\n\n\n\n", "\n  Excelent product\n", "\n\n\n", "\n\n\n\n\n", "\n  It is attractive, functional, sturdy and durable. The same day I received accidentally crashed into a door and my hand was tipped with a piece of metal, only the clock be crashed and get a barely noticeable scratch.", "Keep going great, strong, beautiful.\n", "\n\n\n", "\n", "\n\n      ", "\n        \n      "], "title": ["Casio Edifice Tachymeter Chronograph Black Dial Men's Watch - EF-540D-1AVDF  (ED371)"]},
{"rating": [], "price": [" 5,695.00", " 5,695.00", " 5,995.00"], "comments": ["\n    ", "\n", "\n            \n          "], "title": ["Casio Enticer Analog Black Dial Men's Watch - MTD-1078SG-1AVDF  (A915)"]},
{"rating": [], "price": [" 2,627.00", " 2,795.00"], "comments": ["\n    ", "\n", "\n            \n          "], "title": ["Fastrack Analog Brown Dial Men's Watch - 3070SL02"]},
{"rating": [], "price": [" 2,655.00", " 2,655.00", " 2,795.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n", "\n  Gud one.. the dial can be designed in bright white.. its off white here and makes it dull. I gifted it\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Good looking and functioning very smart.", "worth to buy it.worth to buy it.worth to buy it.worth to buy it.worth to buy it.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Bought for my 11yr old son and he loved it. clear and easy to read display with digital. Auto light feature is really nice.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Casio Youth Analog-digital White Dial Men's Watch - WS-300-2EVSDF  (AD140)"]},
{"rating": [], "price": [" 8,545.00", " 8,545.00", " 8,545.00"], "comments": ["\n    ", "\n", "\n\n  ", "\n\n  ", "\n\n  ", "\n\n\n\n\n", "\n  Is very nice. I liked this watch.\n", "\n\n\n", "\n", "\n            \n          "], "title": ["Casio Edifice Chronograph Multi-Color Dial Men's Watch - EF-539D-1A4VDF  (ED463)"]},
{"rating": [], "price": [" 9,600.00"], "comments": ["\n    ", "\n", "\n            \n          "], "title": ["Tommy Hilfiger Chronograph Off-White Dial Men's Watch - NTH1790684J"]},
{"rating": [], "price": [" 29,995.00"], "comments": ["\n    ", "\n", "\n            \n          "], "title": ["Antonio Bernini Fighter Chronograph Black Dial Men's Watch - AB037"]},
{"rating": [], "price": [" 9,995.00"], "comments": ["\n    ", "\n", "\n            \n          "], "title": ["Tommy Hilfiger Chronograph White Dial Women's Watch - TH1781334J"]},
{"rating": [], "price": [" 495.00", " 550.00"], "comments": ["\n    ", "\n", "\n            \n          "], "title": ["Kool Kidz Round Analog Watch- DMK-009-L.PR 01"]},
{"rating": [], "price": [" 5,396.00", " 5,995.00"], "comments": ["\n    ", "\n", "\n            \n          "], "title": ["Titan Raga Analog Mother of Pearl Dial Women's Watch- 2539SM02"]},
{"rating": [], "price": [" 6,040.00", " 6,495.00"], "comments": ["\n    ", "\n", "\n            \n          "], "title": ["Titan Raga Pearl Analog Mother of Pearl Dial Women's Watch - 9973SM01"]},
{"rating": [], "price": [" 8,995.00"], "comments": ["\n    ", "\n", "\n            \n          "], "title": ["Tommy Hilfiger Chronograph White Dial Women's Watch - TH1781300J"]},
{"rating": [], "price": [" 1,705.00", " 1,687.00", " 1,795.00", " 1,795.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I brought it for my brother's birthday. It was deleivered within the given period, much before that but as complained it's too heavy to wear though stylish.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  the dial is sme what 'metallic color' not exact white as we see in the pic\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  It was really a good one to have it on Hand. It Looks Stylish and simple. So anyone can buy it without any doubt.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Nice watch but weighs too heavy . Also I am worried that thread line on the belt may come out .\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  too heavy and thickness....but stylish watch....i am not recommend this product to others\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Two stars are only for looks. weight is too much\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Fastrack Economy 2013 Analog White Dial Men's Watch - 3099SP02"]},
{"rating": [], "price": [" 950.00", " 995.00", " 995.00", " 995.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n", "\n  Watch as well as sevice Is very gud..but when I received the watch..it was not running..I mean cell was not thr..\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  i like this watch very much i am impressed. this very light weight and flexible to rotate and thanks for amazon.com\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  I am really impressed with Amazon & their prompt services. I am a working person, si I usually use my Fastrack Casual watches during weekend. Amazon just keep us keep us surprising with user Amazing deals & Amazing prices. Rock on!\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  It's a nice watch by fastrack...", "cool, elegant & stylish watch suitable for both casual & formal attire for any occasion\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  its awesome , just go for it . its worth of money", "it has a cool look and has a great box", "i appreciate it\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Fastrack Economy 2 Analog Black Dial Men's Watch - NE748PP03"]},
{"rating": [], "price": [" 2,321.00", " 2,786.00", " 2,940.00"], "comments": ["\n    ", "\n", "\n            \n          "], "title": ["Timex E Class Multi Function Chronograph Black Dial Women's Watch - TI000Q80400"]},
{"rating": [], "price": [" 955.00", " 955.00", " 975.00", " 975.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n", "\n  Just received this product today. Have to say awesome delivery by amazon within just two days. Now, about the product, the looks of watch is very good and kind of little stylish also. But the dial is comparatively small than what it looks on pictures. But apart from that, i am very satisfied with my purchase. Also, i got this watch for just Rs.666 which i had been waiting so long for price to drop. And yes there is a warranty card inside but not filled. Guess, i just have to take the bill to service center if problem occurs. Very happy.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  dial  numbers not matching. under 6, respective seconds number inside the fixed dial was 20 instead of 30.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  A perfect design delivered on time all things are being perfect\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  It doesn't look the same as advertised!\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Very nice watch I got it on 666 only..\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  its worth the price\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Fastrack Analog Silver Dial Men's Watch - NE9333PP01J"]},
{"rating": [], "price": [" 1,800.00", " 1,781.00", " 1,857.00", " 1,895.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n", "\n  watch was good but don't have same appearance as mentioned in photograph (size difference B/w actual & image mentioned on the site )\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  I purchased the watch when fastrack had 25% flat discount.the product is not as good as shown in the picture.and a little smaller than expected. overall its good especially at the discounted price.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  The watch looked bigger on screen.  But actual size was a bit small.  But for that happy shopping.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Got it in Offer for 1705 on Sep 13. Its Genuine Product.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Good...\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n      "], "title": ["Fastrack Hip Hop Analog Black Dial Women's Watch - NE6026SL02"]},
{"rating": [], "price": [" 750.00"], "comments": ["\n    ", "\n"], "title": ["Titan Zoop Digital Natural Dial Children's Watch - C4040PP01"]},
{"rating": [], "price": [" 850.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n", "\n  Very good watch. Clear dial with back light (for night). Our boy get it off the wrist only while taking a bath. :-)\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n      "], "title": ["Titan Zoop Analog Multi-Color Dial Children's Watch - C3022PP02"]},
{"rating": [], "price": [" 427.00"], "comments": ["\n    ", "\n", "\n            \n          "], "title": ["Maxima Analog White Dial Children's Watch - 04411PPKW"]},
{"rating": [], "price": [" 451.00", " 612.00"], "comments": ["\n    ", "\n", "\n            \n          "], "title": ["Q&Q Pixie Analog White Dial Children's Watch - VQ96J018Y"]},
{"rating": [], "price": [" 3,675.00", " 3,715.00", " 3,835.00", " 3,995.00"], "comments": ["\n    ", "\n", "\n            \n          "], "title": ["Titan Purple Analog Black Dial Men's Watch -  9473AP04J"]},
{"rating": [], "price": [" 1,296.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n", "\n  tiny watch .... not working at all..\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  very small watch...i returned it.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Very small.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n      "], "title": ["Timex Sports Digital Green Dial Unisex Watch - T5K363"]},
{"rating": [], "price": [" 1,796.00", " 1,895.00", " 1,950.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n", "\n  Its good.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n      "], "title": ["Titan Digital Multiclolor Dial Women's Watch - NE2419YM01"]},
{"rating": [], "price": [" 945.00"], "comments": ["\n    ", "\n", "\n            \n          "], "title": ["Casio Youth Digital Digital Blue Dial Men's Watch - W-215H-8AVDF (I083)"]},
{"rating": [], "price": [" 495.00"], "comments": ["\n    ", "\n", "\n            \n          "], "title": ["Kool Kidz Round Analog Watch- DMK-004-BK 01"]},
{"rating": [], "price": [" 1,232.00", " 1,450.00"], "comments": ["\n    ", "\n", "\n            \n          "], "title": ["Disney Analog Multi-Color Dial Boys's Watch - 3K1552U-MK-017BE"]},
{"rating": [], "price": [" 486.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n", "\n  The picture might make you feel otherwise, but the dial is a bit small. Other than that, its good\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n      "], "title": ["Q&Q Regular Analog White Dial Men's Watch - VQ84J006Y"]},
{"rating": [], "price": [" 1,705.00"], "comments": ["\n    ", "\n", "\n            \n          "], "title": ["Casio Yout