[{"rating": [], "price": [" 350.00", " 330.00", " 369.00", " 340.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  It is basic mouse from Logitech, working without a hitch. I felt the size of the mouse was perfect when compared to other optical ones that used previously - they were small relatively.", "The product was delivered on time nicely packed.", "It is suggested to go amazon fulfilled products as it provides you better visibility to keep a track of the product till it is delivered. Not sure though if this also happens on non-amazon fulfilled items.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  PROS:", "1) Product delivered as advertised.", "2) Amazon kept their promise of quick delivery.", "3) Packing was good and the product was intact, without any damage(s).", "4) The quality of the product is very good and it feels good in your hands, whether you have a large palm, or small.", "5) Cable is reasonably lengthy, and is of good quality as expected from Logitech.", "6) Smooth scrolling and the scroll wheel can be configured as a button (3 buttons Mouse)", "CONS:", "1) If you used a Mouse with soft button clicks before, you might find this one a little unsettling because the buttons are much harder than the usual, and it takes some time to get used to.", "2) Pointer moves smoothly with fast movements, but small movements aren't responding very well, but it may be due to the Logitech software I have on my desktop computer, which I had configured to use with my previous Logitech Mouse.", "This could be a little annoying if you use Image editing software and you want to do small selections on the images.", "3) Lacks the physical scroll wheel movement for horizontal scrolling. Can only be configured via. Logitech software.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  the best mouse but so underrated.. the build quality is top notch.. i have used this mouse for hardcore gaming.. and it worked like a charm.. i think it will compete to the price range till 1500/- it is that good..", "it is the best overall package.. it is the reason why people are migrating from wireless to wired mouse.. even though you can get wireless once for the same price you would have to buy this one for the ease..", "10/10  its my third mouse, same one.. in three years.. for me it works at an one mouse/year ratio..  the reason i never changed the brand or model is that i broke four mouse both wired and wireless types before i found this model.. the normal models does not keep up to my gaming needs.. you cant say its a gaming mouse.. but the performance is so good you can compare it to a gaming mouse..", "every budget pc gamer's delight.. just go for it and use the best one around.. it is a tvs gold of the mouse..\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  It is nice and value for money , good for office use, good rough and tough mouse it is .\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Everyone knws Logitech is a well branded company in terms of computer accessories. That's y I chose Logitech mouse for my laptop. Its been one month and the product is very nic and its premium finish makes it more attractive. Buy this mouse if you are looking for a best mouse under 500Rs.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Logitech M100r is a great mouse overall. The grip and handling is superb - during navigation, scroll and clicks. A good mouse to have. But having used M100 too personally, I would rate that as an even better mouse. M100 is slightly heavier than M100r giving more control over its movements.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  product is good and comfortable.. no issues.. my previous mouse was also logitech it lasted 3 years.. so i was looking for same logitech design mouse.. i checked in market its MRP is 495.. the least amount shop keeper offered me was 450.. not less than that..", "amazon is selling at 280Rs.. ty amazon for low price..", "i also want to thank amazon for quick delivery.. i got the product in 20 hrs from ordering.. even though it was raining heavily in evening delivery guy delivered product. packaging is awesome.. product was brand new and sealed pack...\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Product is best in such a price...", "As being a designing professional I needed a mouse which can stick to a multi-clicks job....and here I take a risk on this and no doubt, found the right product..Will recommend to all looking for a slight heavy and large handy size mice..as fits perfectly in your hand..works smoothly..!\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Logitech M100r Wired USB Mouse (Dark Black)"]},
{"rating": [], "price": [" 650.00", " 680.00", " 684.00", " 625.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Let me tell all of you that this mouse is very nice and one of the good product. I was firstly purched it but when I received it i found that the back side sensor light was not glowing. I returned it back to amezon..all the amount has been credited in my account. I thought it was a defect. Again I placed an order for the same. And again I found the back side senso light was not glowing. But this time i get in touch with the Dell and I got my answer that in this mouse No LED light facility because of battry consumption. To save more power in battry it was not present.", "So just for you all that this is not a defect .. this facility is not there because of preveting the battry consumption. So do not understand like me that this is a defect in product...Product is excellent... Again i highly appriciate Amezon service here. Gr8 Job Amezon !!\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  The same mouse was available for 700+ where as amazon sold it for 640 :) but now its selling it for 560 :\\", "thanx amazon", "About the product:", "It has BUTTON which opens the DELL part of the mouse.The Dikky of the mouse has the space for the micro transmitter and cell", "PROS:", "WIRELESS RANGE IS FABULOUS", "SENSITIVITY IS PRECISE", "The mouse is compact,it has AUTOMATIC POWER SAVING which switches it off after 10mins of inactivity.Wen u shake it ,it starts automatically .", "There is a ON/OFF button.", "The mouse uses INVISIBLE LASER", "It is powered using DURACELL battery.", "Good for normal Gaming and stuff like browsing,photoshop,Counter-Strike etc etc", "Cons:", "It misses out the dpi button which allows it to change its sensitivity by click of a button. but thats just a minor disadvantage if ur a HARDCORE gamer.", "Conclusion: Buy if you are not a HARDCORE gamer. It gives comfortable experience for normal users.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  i used this mouse from last 10 day .. i also use hp mouse but i found this product more comfortable than any other.... grt feature... power efficient.. no red light in bottom so dont worry about it its fine.... on off button auto disconnect if lappi is not on....\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Awesome!", "May hand is reasonably big. Choosing a laptop mouse can be like finding a needle in hay stack.", "Dell mouse was recommended by a friend, although an earlier version. Based on his recommendation I went ahead with this one, of course after checking the dimensions.", "I like :", "1. nano receiver (Logitec and Microsoft also have it)", "2. dock to insert nano receiver within the the mouse. This is good. I had a logictec mouse, quite an old one which had a button like thing to fix its receiver at the bottom. It would detach itself in the bag calling for a search and rescue operation.", "3. On-Off switch (handy one). Some other brands also have it.", "4. Pretty good build quality (dropped from table once. Survived the fall)", "5. Easy to use -- My parents also manage to use it.", "6. Works well on Linux OS  (I use Linux Mint 15)", "Dislike...  nothing that I have come across yet !\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Close your eyes and buy it. Looks great. Clicks work very effectively. Pure plug and play and very handy. Works on one AA battery. On/Off button at bottom is very useful. USB connector is also very compact, is almost invisible when plugged in. Easy operation and worh it's price.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I received the DELL WM123 Wireless mouse,(as I was having DELL laptop) on 8th Sep 2014.It stopped working on 25 th Sep 2014. When I viewed the return policy,it is mentioned that return window closed on 20th Sep 2014. I don't know what to do, It worked only for 16 days. I tried with a new battery also. No ,it refused to work.I contacted Amazon, but I was told to contact Dell directly.The product is a Amazon fulfilled product.I was ordering all along with FLIPKART. But this time I wanted to give a try with AMAZON., as it was AMAZON fulfilled.(???!!!)Very very Bad.Dell people will be telling me to bring the product, this mouse. They may ask me to come for another day to know the status.I have to spend atleast five Lrs of petrol for my car and parking fee and all these things. I will be forced to spend not less than Rs500-00 for a product purchased for Rs564-00.  It will not be prudent to purchase anything from AMAZON. in FLIPKART the same product is priced at Rs 625-00 and is having a 30 day replacement guarantee.Ofcourse, I have not ordered with Amazon for the sake of Rs 61-00. Actually I wanted to give a try, otherwise I was very much satisfied with FLIPKART.I have made a childish attempt and learnt a lesson at a cost of Rs564-00.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Received today 14/10/14 as ordered on 09/10/14.", "PROS:", "Good/Smooth Performance.", "No laser light which saves battery consumption.", "Instant Connect.", "CONS:", "Little Heavy because of the Battery and you can't help it!", "Bulky Looks. Like old traditional mouse type look.", "VERDICT:", "If you are not aware of it ever:", "Wireless mouse doesn't use the Native Wi-Fi 802b/g/n Technology. It comes with a separate Wireless Adapter which just connects it's own device. Hence it got to have a dedicated USB Port all the time for the mouse to work.", "Laptop users having limited USB Port, would suggest to go for Bluetooth Mouse instead as it would save your USB Port for other uses. But remember Bluetooth Mice are prone to face disconnection issues often! Read reviews before making a purchase. Else USB Hub can be used but it makes the laptop little less portable...\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n\n\n\n", "\n  ", "\n", "\n\n\n      ", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Dell WM123 Wireless Optical Mouse"]},
{"rating": [], "price": [" 300.00", " 345.00", " 345.00", " 300.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Logitech's this mouse is quiet good for normal stuff, 3.5 stars but amazon won't allow half star ratings :/", "It is not heavy at all and works just fine.", "Recommended from my side for normal usage.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I was at first skeptical about this mouse as among few of my friends left click of its M100 counterpart stopped working. After going by its reviews on amazon.com I bought it with fingers crossed. But I have no regrets at least till now after using it for over a month. I will update if so happens in future.", "It fits the palm perfectly and is and is effective in its functioning. Its cord is quite long and will serve for all practical purposes.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Amazon packing & delivery were good. I bought this mouse for Rs. 280 a couple of weeks ago and now I see a drop down in price to Rs. 258/-. Initially I wasn't sure of buying this mouse as I've never used Logitech products before. This mouse is up to the mark. Recommended to all laptop and desktop users.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I would definitely recommend this product to everyone for daily stuff. I bought this mouse for Rs. 258 and you can't get better option in this price range. and come on its Logitech which is better than others like hp and dell.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  I bought this one month back and it's one of the best wired mouse infact by Logitech. I know this is also one of the smallest mouse I should say but there is another one which is smaller and better than B100 by Logitech company (in wired technology, good accuracy but quite old :-)), thought I bought that mouse but unfortunately got this mouse. the picture on the web was not clear when it comes to design but it's worth it with the price that I have paid. Good though.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Bought this mouse 2~3 weeks before and now the mouse is not working properly (cursor is not moving in my computer when I move the mouse). first, though that it can be related to any issues like conn-problem or perhaps my desktop is having compatibility problem(just wanted to rule out the possibility) but then I found the same problem existing when connected with an another computer.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Nice and decent mouse. Scroll button is a little tight. Design could also be changed for good as I remember to have owned one such ages back. Though the ball mouse is now a light sensor, the overall shape hasnt changed a bit over the years. Isnt it time for some change Logitech?\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  I've been using the mouse for the past week & it has been excellent.", "Packaging & delivery was decent.", "I found one thing annoying that the delivery person was constantly insisting me to pay by credit card whereas I had specifically said that I'll be paying by COD.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n\n\n\n", "\n  ", "\n", "\n\n\n      ", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Logitech B100 Optical Mouse (Black)"]},
{"rating": [], "price": [" 1,170.00", " 1,200.00", " 1,200.00", " 1,170.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  i checked keyboard and mouse in my office from 15 foot distance and also from other cabin also work so,", "this is very very very nice wifi range and auto shutoff system for battery life , when you not touch mouse and keyboard for 30 second they they automatic shut off so BATTERY SAVING mode automatic activated after 30 second.", "- keyborad stock is very very smooth, not like microsoft and iball but compare to other keyboard this is MAKHKHAN", "- keyboard up key is very small otherwise all key are good.", "- very small and with FN (function key) for space saving keyboard and giving all function with this key like", "  HOME, EMAIL, SEARCH, CALCULATOR, MUSIC ,BACK, PAUSE, NEXT, MUTE, VOL DOWN , VOL UP, PRINT SCR, &  PAUSE/B.", "-  come with 2 AA battery pack and 2 AAA battery pack and both are premium GP ALKLINE BATTERY PACK.", "-  mouse working on my office table without mouse pad.", "-  go for this and save your space on table in this type of small and powerful ranging keyboard you not finding in any other brand in 1000 rs.", "thanks amazon very very very fast delivery and very very nice 3 layer packaging. i think packaging coasting is nearly 50 to 70 rs. so thats about BEST SERVICE FROM AMAZON.", "AMAZON TRACKING UPDATE WITH SHARP TIMING ON SMS AND EMAIL BOTH .SO TURN OFF YOU EYES GO FOR AMAZON.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Pros:", "Keyboard is sturdy, small form factor.", "Pre-defined volume control keys. Function keys can be customized using Logitech SetPoint software.", "Full sized mouse with invisible optics.", "Customizable mouse middle button (via SetPoint).", "No visible LEDs in mouse or keyboard to save battery.", "High DPI mouse, better that cheaper wired variants.", "Relatively longer battery life, as compared to other brands.", "Highly suitable for students, internet users, casual gamers.", "Saves desktop space.", "Cons:", "Mouse battery cover is a little loose. Cover opens up when is used on rough surfaces, like on fabrics or rough denims.", "Both mouse and keyboard lacks on/off switch. Battery is to be removed to turn off mouse or keyboard.", "No status indicator LEDs on keyboard. SetPoint software is to be installed for OSD and battery level indication.", "The keys at the edges (function keys and arrow keys) are too crammed.", "Not suitable for heavy use or hard-core gaming.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Delivery experience is good, I have opted for standard delivery, they tried to deliver on 3rd day but did not find the address, delivery person called me on 4th day and found the address and delivered it.", "About the product, Logitech MK220 Keyboard is not up to my expectation, the disappointment is that the key board and mouse have no power button(s). Once we load the batteries we do not have control on the power and the gadgets. on the key board it is mentioned about 'Auto sleep' but not sure how efficient it is. In spite of keyboard's Auto sleep feature, I feel the power control button is very important to control the function of the key board especially to avoid interruptions due to unintentional press/moves, same with the mouse. The key board layout is very tight, of course it is compact but it is little uncomfortable when to deal with the buttons on the edges. And unlike other branded mouses, the Logitech mouse needs two AA batteries.", "Overall its not a great product but if you are not so concerned about power buttons and the compactness of the keyboard, you may still go for it.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Near perfect compact wireless Keyboard. Soft, silent, well positioned keys with good tactile feedback.Function Keys in the top and up/down, Left/Right arrow keys made smaller to achieve compactness. Should not matter for most users and if it does matter to you, look elsewhere and not a compact Keyboard.", "Ergonomic mouse that feels natural to hold with smooth cursor movement. Smooth scroll wheel. Comparable to the good performance of the much costlier MK305 wireless mouse ( which I have been using for many years.)", "2.4 GHz wireless connectivity. In my environment worked fine with no connectivity issues.USB receiver could have been a little smaller. ( The USB receiver of my MK305 mouse is much smaller and hardly comes in the way when packing the laptop.)", "Plug and Play. For added features users can download and install the Setpoint software. (free).", "Overall, for the price it is an an excellent , compact, lightweight KB and mouse to carry with the laptop. 3 years Logitech warranty. Can't ask for more.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  ADVANTAGES:", "*key board functions good as the keys are very easy to type", "*small size of keyboard looks handsome", "*mouse have a good weight and is very user friendly", "DISADVANTAGES:", "*key board and mouse works only when it is only very close to the reciever", "other mouses (adwick) can even works at distances", "*no indicators to check the activation of CAPS LOCK, NUMBER KEYS so it makes difficuilties in typing passwords", "*invisible optical to check mouse\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Product is good and delivered quite quickly in very good condition. Mouse is very good to operate but keyboard is not. Keys are very small and closely placed. Need lots of practice to press the right key otherwise you end up in pressing multiple keys and sometimes wrong key. I would recommend to use a full sized keyboard like desktop keyboard and not this one.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Logitech MK220 Wireless Keyboard and Mouse Combo (Black)"]},
{"rating": [], "price": ["\n        \n            \n            Sign up to be notified when this item becomes available.\n        \n        \n    "], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  OK.. Here is my first review after 4 days experience with Arya Z2 .", "Looks: Mat finish and Shining finish on sides gives it some serious looks. Some times it gives a resemblance of xperia z.", "Performance: Super. I didn't find any lagg till the date. I have around 15-20 apps installed and it is working fine. I haven't tried with the gaming part yet.", "Display: Decent display which support all HD pics n videos.", "Camera: This is why I took out one star fron my rating. Being honest it is a bit on lower side especially on dim lightings. Earlier I was using a Nokia lumia 800 n 8 mp camera is nowhere near to that. I think I can match it up with Samsung 8mps. 2mp front cam serves its purpose but again the same case as I mentioned earlier.", "Battery: U can call it as decent. With Internet on I use to get about 12hrs backup. Without data connection I assume I will get at least 1n half day.", "# Loud speaker is good.", "#Ear phone exp is bad. May be a branded ear piece can solve this.", "#The upper portion of the phone gets heated up during charging and calling. (It cools down instantly)", "So considering the price tag, Arya z2 is superb. If u r not camera geek, you can surely go for it.", "Opting out this factor I don't have any regrets in this purchase.", "4 ****\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  ", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Well here is my first review of the handset after a use of 3 days.", "So far its not the best i've tested. But it is one of them.", "There are no lag issues even though I multi task with games running on the background.", "The camera is amazing. Even during low light it clicks some premium pictures.", "The os interface is stock android 3.", "About the heating issue. It sucks!!! However its a good thing aswell keeps u away from game addiction ;) this is the only reason i gave it a 4 star rating", "Battery back up is reasonable lasted me for 1 and a half day with wifi usage", "Will test is for a few more days and write the final review.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Good mobile at 6999", "The Display was Pretty good .The brightness was awesome it glows like anything.", "just 2 days ago i got this phone. I have'nt installed any apps till now.", "but iam looking for standby time", "Its was good.output sound was pretty low and earphones are not upto the mark and we should not except more at 6999.", "Coming to camera the dim light photos are dull not that much it is avg and front cam is better for voice calling in daylight.", "Thats all after watching it for 2 days..\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Main problem with this phone is:", "1.Battery drainage rate is extremely high", "2.Low internal memory for app install though we can shift installed app into SD card.", "3.App launcher is stopped for sometimes.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  This phone is very impressive..i love it .... 7000 rs mai ye phone mast hai..phone looking is superb... gamming performance is best....all hd games playable....screen is too good....\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  this mobile is very good but headphone is low quality mera head phone damage nikal gaya hai lekin abhi tak head phonr ka paisa bapas nahi diya gaya hai\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Its good in comparison to Red Me (as in Arya Z2 no heating issue, no MUIE so user get near to 550 MB of RAM free instead just 150 MB so not an issue of apps closing down and no any distortion in call quality) infact i booked both but latter i decided to cancelled the order of Red Me", "multitasking, camera superb in fact better then mid segment of Samsung phone or moto g", "It onlu Cons", "Battery s'd ne minimum 2500 miliAmp not 1800 as offered", "no OTG but its not a major prob", "Overall i gave 4 ot of 5 star", "Satisfied with products value for money\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Arya Z2 (Black)"]},
{"rating": [], "price": [" 17,895.00", " 19,500.00", " 21,000.00", " 16,599.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  No issues with the product but the MRP 21,900 is incorrect and accordingly so the discount 23%. This is the MRP of the A7 chip.", "The A5 chip Mini is at MRP 17900. Someone needs to correct this or it will mislead people!\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  ", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Sorry for saying this, I received only black color instead of White- Silver. I don't want to make big issue over this so i left it behind.", "Kindly make sure you are not repeating this mistake.", "Regards,", "Karthikeyan Thamaraiselvan\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Apple ...well I am not going to review but wanted to try it once after my Samsung Tab and Lumia Phone. Will rate it above Android Tabs for sure. If ever A Tab in this range comes with 8.1 OS will go for it till then this is best I will say. Another best part is obviously the feel factor (psst.. satisfaction of owning an apple is 2nd ;-)", "The OS is itself the core which makes the whole experience better. Choose wisely on STORAGE OR Connectivity (WiFi + Cellular or only Wi-Fi) depending on your requirement.", "One who travels to places where no Wi-Fi is available can always rely on using Mobile as Hot Spot and then take higher storage or have Cellular version with Cloud Storage as choice.", "If you are a 1st time buyer and you plan to buy it in next 8 Months till march 2015 go for Cellular version with whatever storage your budget allows. After that hopefully lots of Wi-Fi companies will have public place plans.", "Personally cutting 1 Star for Cost...(when will Apple bring down its prices..but the thing is why should they)\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Excellent product as usual from apple. User experience absolutely easy to navigate. Kids love it too because of ease of use. Can be used as educational toy too.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I got a new iPad mini from amazon India at a stealing price on the next day of order. I have  already couple of apple devices including iPad 3rd gen. But the mini version without retina display is made to fulfil the basic need of internet browsing,social networking and utility apps on a big screen. iPad give a moderate screen resolution of 1024 x 768 with 163PPI, which is enough for the day-today usages. If you compare the screen with retina one then difference can be seen in fonts and the edge of app icon, brightness is also less then retina display. iPad is available in two different sizes of 7.9 and 9.7 inches, 9.7 inches screen is the perfect size gives full advantage and feel of big screen. But mini version is more popular then the full version of iPad. iPad mini is more affordable and easy to carry around, when somebody use public transport during travel mini is advisable. Professional graphic designer, photographer and gamer will not satisfied with the mini iPad. iPad air and mini with retina display and A7 chip is for professionals. The basic difference between the tablet computer with android OS and made by apple with iOS is the screen aspect ratio and application specially made for iPad. iPad has 4:3 aspect ratio and android has 16:9, 4:3 ratio made iPad around 30% more spacious then android tablets. iPad is more useful to browse net because of the screen ratio. For most of the works 4:3 screen is perfect other then watching movies which are made into 16:9 ratio. App Store is the one the strongest point of iPad with more then 475000 apps specially made for the big screen and still increasing. Apple products are produce by great product designer and collectable device. And now with reduced price it is a deal.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Apple iPad Mini (16GB, WiFi), White-Silver"]},
{"rating": [], "price": [" 11,149.00", " 13,999.00", " 15,180.00", " 11,159.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Hi All,", "Please find below Pros and Cons for Panasonic P81 :", "Pros :", "1) Octa core Processor made device running smoothly with no lag. Touch is very smooth.", "2) Panasonic has provided a lot of customization in the device. You can set different different wallpaper on screen (like for screen lock, home screen). You can also change the background of message screen.", "3) 5.6 GB space is available for user and apps which is awesome.", "4) Phones comes with lots of pre-installed apps like Notes,GMAIL,Maps etc. Also Panasonic has provided free subscription in various application like Evernote, Hungama, TOI, Readwhere for limited period of time.", "5)  Play More option is available in the phone which provide users to perform the customization.", "6) Wifi and Bluetooth is working fine.", "7) Gesture play lock is available. You can lock each app by different different pattern. (However personally I didn't much like this feature)", "8) Battery backup is awesome. 2500 mh battery power gives you the backup of at-least two days with using of Wifi and calling.", "9) Panasonic has provided Screen guard, Flip Cover, charger,battery and headphone in the box.  Headphone are good but not so good.", "10) 13 MP back camera gives you the good quality of picture in day lights. But don't expect high quality with the camera.", "Cons :", "1) It has multi window option, means you can work with two application simultaneously. But the apps you want to open in multi window are fixed like E browser, Message, a video player and Notes. You can't open other apps in multi window.", "2) Voice quality of calling/receiving of phone is not good. You need to more focus on voice when you are talking to people.", "You won't be able to hear the voice in traffic.", "3) Camera quality is not up to the mark and selfi camera is not good.", "4) 1 GB RAM is not enough for a product which has Octa Core processor.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I purchased this product through Amazon. Amazon Service is really excellent. They delivered the product well before the committed date.", "Coming to the product, I found some sound clarity issues in the phone. I am getting Voice distraction while speaking. I felt, It is not as good as other phones when we are speaking over the phone.", "If you come to rest all other features, it is really excellent. Performance is too good, if you compare with Samsung phone in the same price range. Light Weight, Good Battery life..etc.", "If you wanted to try, I suggest you to buy through Amazon. Because, if you do not like the quality of phone, they will take back.", "Regards,", "Sathish\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Very good workmanship of this Mobile P- 81 from Panasonic,together with fast processing speed, very crisp and sharp picture quality on 5.5 inch display. Every function is really commendable. Received at a competitive price or Rs.12,200/- although could have been still little less as it came down to Rs. 10,770/- in lightening deal. Flip book cover is good and prortection is adequate from scratch ressistance film supplied with unit. Delivery from Amazon could have been expedited bit faster,since unit remained with shipper for three full days in Jaipur, and this could have been expedited. Amazon should look into this kind of delay caused by courier/ shipping companies. As far as Amazon is concerned ,I am satisfied with product, price and follow-up actions taken by them. Ramesh Goradia.26th Oct.2014- Mumbai\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Initially i was not very sure whether to buy Panasonic or something else since the brand doesnt have much awareness and how would the product turn out to be, let me tell you this is a very nice product value for money totally. This for sure beats Samsung Grand Segment as well as Micromax Canvas series. Do not think twice before buying it. Im a panasonic fan after using this product neat packing nice look amazing touch this all im writing against my experience of BB, Samsung, Iphone, Nokia.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  I was looking for a mobile which should be big screen and all main facilities. I thought Panasonic is also very good in mobile and really I hate this mode. I could not able to configure my office outlook emails and not able to connect to the laptop by data cable. It sucks my days after the purchase. More over the smart phone which I was looking for is to access corporate email and good cam.", "It is very very bad mobile, don't go for it and it is useless for the people who want to access corporate emails. Because, even Lava, Micromax and Karbon mobiles have these facilities at even Rs. 5000/-. Why not Panasonic?", "There is no Microsoft active sync option to configure my corporate email and the customer care is very worst to solve this problem.", "If anybody knows how to sync emails, please help me out and send a mail to mahesh43@gmail.com or contact me I wanna sell this mobile> It was delivered to me on 9th of November and not used properly.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  its 5 star product but the 13 MP camera is not at expexted and also the front camera is not that good its ok", "as its 2 mp but the 13mp was worst i can get good clearity with 8 mp in some mobiles in same price range . so if  u r camera lover it will not work for u . speaker good ,touch is good all other things except camera are good\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Wonderful gadget.", "Processor is real fast. Speed is unmatched in this range.", "Display is bright and lovely and resolution is awesome.", "you can view it from any angle without losing the picture quality.", "Phone is not lagging even after installing 30 Apps including 20 games.", "Only one cons : Camera is not as stated. A 14 MP camera but picture quality is not that great. Its as like Samsung's 5 MP camera and Micromax's 8 MP camera. HD recording is good, giving some nice output in decent light. In low light the camera doesn't perform well.", "Conclusion :", "Panasonic is a silent surpriser to watch out for in the future. I got this P81 in 10990. I don't think any other phone at this range can be compared with this masterpiece. So happy to have it.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Panasonic P81 (Black)"]},
{"rating": [], "price": [" 15,240.00", " 16,600.00", " 26,999.00", " 13,500.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  1-Touch is very good.", "2-Screen's Pixel rating is very good but camera is worst.", "3-16 mp and 8mp without any feature and pixel bursts when we zoom the pic.", "4-Color graphics are not satisfactory.", "5-Looks are average.", "6-Processor is very fast.", "7-It doesn't have gorilla glass so you have to take intensive care of the screen.", "8-Inbuilt memory is very much satisfactory\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Awesome phone with great features.", "Build quiality is better than Samsung or Sony.", "The first Indian product which i belive is made upto international standard.", "The operating speed is terrific.", "The camera quality is better than Nokia, Samsung and Sony....i'm telling as i've used all the three brands. Specifically the front camera is much more better compared to other brands.", "The features we are getting at the quoted cost is best.", "Sceern clarity is simply awesome.", "The music quality on the speaker is nice.", "About battery : When you have a Octa Core processor it will surely consume battery. If you are a casual user you'll get a battery backup of two days.", "Overall i would suggest people to go for it without thinking more.....Cheers Amazon and Cheers Micromax !!!\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Battery Back up is very poor. And Phone will stuck with no Reason. Comparing this phone with others Brands(High end models) doesn't make any sense. Long way for micromax to improve in every aspects.", "main Advantage of this Phone -> Phone will heat up like an iron box when we play games. So play games and then use phone to iron your Clothes. 2 in1 phone.", "Camera with 16MP is not at all equal to atleast 5 MP in the night mode. As expected from Micromax. Lol.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Purchased this smartphone during the Dhanteras Festival Blast and owned it at INR 13,499/-. I received the phone soon and started using its features. The phone looks classy and one may identify it as iphone 6 by mistake. The camera function, heavy multi-tasking activities executed precisely. Battery stays for almost 2 days (including roaming) with about 4 hours of talking, considerable amount of photography, web browsing and music. Feel Satisfied and worth every penny of my hard earned money. Keep it Up Micromax. :)\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  One of the best at the price.", "The design is just awe, with glassy finish on both sides with metallic edge.", "The display is good @441ppi.", "The primary cam is 16 but the definition is around 13, where as the secondary cam is good.", "The heating issue only occurs during long gaming hours.", "Battery is decent upto 14hr@H+.", "The processing speed is amazingly fast.", "Touch response is decent.", "Good sound output.", "Only drawback is memory, only 1.5gb is allocated for apps and no secondary storage.", "And the updates rollout a bit slower(just heard off).", "Overall an awesome gadget with complete pack to have at a cool price.", "Thank you.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Regarding phone - No external  memory card option. Rest everything is smooth and good specs. Liked it with decent deal i have got (13k with 10% cash back option). About Delivery, it was delayed  by the courier and it took more  than 10 days to reach me (with few follow ups and escalations with Amazon beyond promised delivery date). Order only if you have patience to wait for like 10 to 15 days for delivery from ordered date.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Advance features which can be showcased with other branded mobiles.But battery drains with in half a day with normal use without gaming.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  ", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Micromax Canvas Knight A350 (Black-Gold)"]},
{"rating": [], "price": [" 6,779.00", " 6,946.00", " 7,099.00", " 6,459.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  ", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  ", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  All my smartphones suddenly got out of order.", "I needed a backup phone.", "I went to Flipkart, Snapdeal and Amazon", "and went through specifications, reviews and prices.", "It took me 03 days to chose a mobile and I chose Micromax Unite 2 A106.", "I ordered it from Amazon.in and got it delivered in 03 days", "I am pleasently surprised to find a mobile of Rs 7000/- can be so good.", "Except for the camera and build quality I am satisfied for everything.", "The battery has superb performance with 3G and FM.", "Remember I generally use Galaxy Note 2, Apple Iphone 4 and Galaxy S2.", "And naturally the benchmark of comparison is high.", "But Micromax Unite 2 A106 has surprised me and make me happy.", "Thanks to Micromax and Amazon.", "and thanks to me for not choosing any basic phone.", "It would have been waste of around Rs 1500 to 2000.", "Con : It gets heated up a little at the back near the Micromax logo on heavy use of app in Vodafone 3G.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  they sent product through Indian post. not so much delayed. the small problems-1.less battery back up- but you should keep in mind that all andoid phones has less battry back up.so it is not a great problem.2.sometimes the phone gets HANGS when dialing a number....it does not happens always,,,,only some times.... 3...phone gets heated up after a long term use 4.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  The BAttery is a big downer. Says about 8hrs of talktime & some hundred hours of standby time. I am a very light user of my phone and yet, in spite of following directions for a 1st charge of 4-5hrs, my battery lasts not 1 full day, of which email checks and browsing is about 1hr and another 20-30min of phone talk time. I got the phone for my mom as well and feel bad to put her through the hassle of worrying about her phone dying on her all the time. It sucks having 2 phones, 1 in India, another in London, both functioning consistently well below their publicised talk time. I am aware smartphones' batteries last less than non-smart ones, but I see the lower end models lasting atleast 2.5-3days for medium users, so this does seem like a model battery issue.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Micromax Unite 2 A106 (Grey, 8GB)"]},
{"rating": [], "price": [" 5,475.00", " 5,840.00", " 5,888.00", " 5,499.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  My main criteria was 5\" screen and powerful battery (since all other features will be there by default in a smartphone) and thats why shortlisted for A177. But my bad luck I received a defective piece. The phone was struggling to clamp to the network. Tried with different SIMs in both the slot, but hardly got any signal. My friends were complaining about the clarity of my voice during the call. Since  the basic functionality not working properly I returned the device  on 30th Oct.", "  Meanwhile tested the other features...wifi, Bluetooth, GPS, etc and all working fine.. The camera is decent enough; atleast I wont complain on that part. I was using Lumia 520 and A177 pics (daylight) are almost on its par.", "  I was amazed by its battery life. It stood strong for almost 1.5 day with a single  charge. I used wifi for 12 hrs, 3G for 4 hrs, listened to music, watched videos, used maps, emails, camera..", "  Initially I was skeptical to buy Micromax but nevertheless I felt this is a good phone and so I again ordered for another A177 (will receive it today). And I'm pretty much sure that i wont be unlucky 2nd time :).", "Amazon policy are really customer centric. Hats off. Giving 4 star.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  i am writing this review after one week`s usage of this phone. bought this model after considering the reviews of other mobile phones from amazon.  i was bit confused to buy micromax unite but finally decided to buy this because of the 3000mah battery. this is really a lottery win. 1gb ram, dual sim, 4gb internal memory, 32gb expandable memory, android jelly bean and all the more 3000mah battery! good speakers with high definiiton video and audio. i can listen to music and youtube videos through the speaker just like as in an led tv. no lagging, no heating, good touch sensitivity, big screen, so many inbuilt applications, high end specifications. the only defect is poor camera quality. but i did not buy this camera for becoming a professional photographer . the camera quality is enough to serve the purpose. it is really a bargain to get this phone for just 4500/ on offer from amazon. shipped very fast. good packaging. i would really recommend this to all. initially i found the phone too big to handle but it is slim and light weight.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I ordered this phone on 7th Oct and it was in my hand on 9th Oct. Amazon service is really very speedy.", "Box was properly packed and it was brand new with all the accessories. I inserted my sim and started to check it's features. All features like Bluetooth, WiFi, charging were working properly. But suddenly while checking I noticed that there was no network in my phone. I went out of home and network appeared. I get full signal in my other phones so I was bit worried about this. I inserted another sim and same situation. No network. I tried different variation like inserted sim from first slot to another, add two different sim's in two slots etc. But no change in signal. After doing some r&d I found that phone was not picking signal in any building only in open air I was getting full signal. Even that was also dropping abruptly. So I decided to return as it was not serving my purpose of calling from home.", "Besides this phone is really nice. If you hold it in your hand you feel like you are holding 15,000 rs. phone. Camera quality is average but if you increase white setting in it, pics look better. Sound through hands free is average.", "On 12th Oct amazon representative picked up phone from my home and on 13th I got money in my bank account. Again amazon keeps it's reputation.  I will not blame seller for this. May be this piece was not good. But otherwise in 5K range this phone is really good.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Well, I had ordered this for my dad and thanks to the Amazon, it was a very sweet deal... I wanted a normal budget starting range phone with Big screen, hell of a battery and normal camera and I guess, this phone fits the bill perfectly. Till date, this would have been first dad's first smart phone so specs doesn't matter to him much, I just wanted him to learn Android and we know, Android needs powerful battery. They tested other functions and it was working perfectly fine, within 5K, there was no better deal then this one. I gave a thought to reorder this phone from some other retailer but then saw the deal for Lumia 625 and ordered 2 phones through Amazon....", "It's just that I was unfortunate and received a bad lemon, there was some glitch with the camera and we were getting distorted image, one of my colleague has this phone and it works pretty fine as per the price tag. It was my first Micromax product and had to return it.", "I would like to add here that Amazon should switch to replace the product policy rather then simply refunding the money just like their big competitor does...they should refund if the Customer asks for it or if the second piece is also bad.", "We returned the product and in due process, my retired parents felt discomfort as there is no pickup policy for my area, they had to pack and send it through India Post, which totally beats the purpose as I order things online for my parents comfort.", "Last thing - Amazon's own delivery is Superb.. no doubt about it but this product was delivered by INDIA POST, it took 10 days within Haryana to deliver it from Mewat -> Gurgaon -> Faridabad... India Post totally match to its reputation and sucks. They sent the delivered acknowledgement in the afternoon but actually delivered the product in the evening, and we all know why, for the TIP they ask for with every mail/parcel/delivery they do.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Micromax Canvas Juice A177 (Black)"]},
{"rating": [], "price": [" 7,840.00", " 7,990.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Bought Device, as Samsung reduced the cost to Rs.7,900/-", "But I'm Really disappointed after using.", "WVGA 800 x 480p screen Pixels resolution for 4.5 inch looks bad display, needed still better pixel resolution(900x540p) with wide viewing angle.", "Samsung Claims this as Successor of Galaxy Core Duos with Quad core Processor, But Fact is most of the features are removed to reduce the cost.", "Cons:", "Bad Camera Performance,", "No Light sensor.", "Performance is slightly improved than Core Duos by providing Quad Core Processor. But Device heats and lag some times while playing Higher end Games, Only 700MB available, Needed 1GB RAM for handy performance. If you are Gamer Be away from This.", "Google's Android One with Micromax is far better than this.", "Click this review helpful, if you agree. So new buyers be-aware, And Samsung notice and make further development as per Need, and also fix the price as Features Provided.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I bought this phone 2 months back in sep since then i m using it , have not tried hardcore gaming but i dont see anything  problematic. This phone is absolutly fine now the price has dropped makes  good choice to go for. I think this phone has been overcticized.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I bought this phone before one month and I am fully disappointed with its performance. From the second day after purchasing the device, it began restart automatically, without any reason. The problem still continues...\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Received in good condition. Working fine. Thanks for quick delivery.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  You will say wowww after see this ph first time nice look camera n flash quality is too good, big display 4.5 than galaxy core 4.3 with ram 786mb but can't issue for ph speed enough for os android kitkat\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Awesome phone and very nice features quick touch response and good battery backup and also delivered on time by amazon thank u for your great service.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Excellent\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Very bad courier service its showing in transit from the last 6 days and its in kolkata from last 4 days , i dont know what these guys do. I think these guys have taken oath for not to delivering the product before the date they have put...really disappointing..... And am not going any more item from this amazing a amazed amazon\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Samsung Galaxy Core 2 (Black)"]},
{"rating": [], "price": [" 5,939.00", " 6,825.00", " 6,990.00", " 5,939.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I don't know ,how can dealer is getting profit.Actual price of this camera is 7490 but i got for very low price.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  amazing and cool camera i like products of  sony brand super crystal clear nice amazing photo shoot i love this product thanks for amazon\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  showed silver in the image and sent black piece.", "its quaility is low and image quality is bad. unsatisfied and gonna complain against amazon.in\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  DSC W810 and DSC W830 are the two new cameras Sony has announced recently ( Feb 2014)  of which DSC W810 is the cheaper one. Both features a 20MP sensor.The main highlight of both cameras is a 'Party Mode' which according to Sony \"automatically adjusts ISO sensitivity, exposure compensation and saturation to enable easy capturing of vivid party photos, no matter the lighting conditions.\" DSC W810 offers 6x optical zoom.", "Image quality is good for the price,though if you can spend a few more bucks i would very much suggest getting a DSC W830 since it comes with a Zeiss lens and Optical SteadyShot resulting in better images.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Sony japan has better quality control than sony china .sony products which are made in japan are relible,  durable and better than their spec but made in china sorry to say are really china product\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Liked the product. Its nice and meets my expectations.It is similar to the product shown at showroom. So don't worry about not seeing it before purchasing....\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Item is ok and safely delivered but as per product specification result not obtained.", "Like Mega Pixels (MP) given 20.1 with HD, but  recording and photos not captured as per desire.", "As compare 20.1 MP Sony camera, my mobile given better photo and recording with 8 MP camera.", "Thanks with regards", "Sandeep Singh", "9729629490\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  its ok i was using canon ixus one of the old models it was very user friendly comparing to sony cyber shot settings are confusing not even proper detailed user guide is in the box .delivery and amazons performance i will give a rating of 5\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Sony Cyber-shot DSC-W810/B W Series 20.1MP Point and Shoot Camera (Black) with 6x Optical Zoom, 4GB Card and Camera Case"]},
{"rating": [], "price": [" 230.00", " 215.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Got this memory Card for my Phone Moto E.", "It is a class 6 memory card which says it can transfer data @ 6mbps speed, For Mobile phones class 4 or above will be good.", "1) Data transfer speed is very good when connecting it to laptop.", "2) Video and photo gets saved without any lag.", "3)Phone functions with usual speed, no lag after inserting the card.", "4)Gallery and apps installed on the Card also accessible instantly. No lag found.", "Very Good SD Card for this price. Go ahead.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  i purchase this and its very fantastic to use....", "the transpotation is ve ry fast i take this in 2 days ... its a good for user\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  bought 2 nos , one worked the other did not. Defective Product was returned to seller but confirmation not recvd even after 10 days\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  The product was delivered before time. I ordered it on 21st October and it was scheduled to be delivered on or after the 29th, but to surprise it was delivered today,the 25th. It was a perfect gift for my sister on the day of 'Bhaubeej'(bhauduj).", "I got this memory card just @99 bcoz of diwali offer, so i doubted its quality, but it is working very well. Thanks Amazon for making the Diwali special for me and my sis.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Another great product from Strontium. No problems with it so far. Using it in a cellphone. The product is as described.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  This product is simply outstanding.It is very fast and ROI is very good if you invest in this product.You will get results more than your expectations.And to add to that i got this product at an amazing price of Rs 99 during Dhanteras sale.Can not get better, and i would recommend this memory card even at a price of Rs 200.Go for it.Comparable performance to sandisk and lifetime warranty.Thank you Amazon.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Good quality micro sd card with high speed data transfer.", "Class 6 at the rate of class 4.", "Grab it now.........\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  THE ITEM IS TIME AND AGAIN SHOWING IN THE TABLET THAT YOU HAVE INSUFFICIENT SPACE EVEN WHEN THE MEMORY CARD IS  OF 16GB.AM UNABLE TO DOWNLOAD OTHER APPS AND TO INSTALL ONE I HAVE TO DOWNLOAD ANOTHER.IT IS NOT SERVING THE PURPOSE FOR WHICH IT WAS BROUGHT.", "WHETHER THE PIECE IS DEFECTIVE OR AMAZON IS NOT SELLING STANDARD PRODUCTS OR WHETHER STRONTIUM IS NOT RELIABLE, I AM NOT CLEAR.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Strontium 8GB MicroSDHC Memory Card (Class 4)"]},
{"rating": [], "price": [" 24,990.00", " 24,999.00", " 25,499.00", " 25,049.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I am into photography for 17 years now and this is my third SLR camera. I was a bit surprised with the number of 5 stars this camera is getting and was wondering if this really deserves this.", "Simply put, the Canon 1200d is to dSLR what a Tata nano is to cars. There are the BMWs, Audis and the Swifts, but only cost does not give this a Five stars!", "Most of the 5 stars are from 1st time SLR users who are in the so called honey moon period. I am not saying this camera is bad, but this is being over hyped here.", "Remember, this camera has its limitations due to its low cost build. There are so many point and shoot cameras at the 12K range that have better build, resolution, zoom, aperture, display screen, good glass lens, panel and what not? Most of the features in dSLR are things which you would NEVER use and that’s the reason I am saying please get a camera for your requirement and not just because you are getting a cheap dSLR.", "Do not sell your Harley Davison to buy a Tata Nano. This is a doctor’s prescription, what works for me may not work for you. I am just trying to be sensible here.", "My two cents to all proud owners –", "1. Canon has given you a wonderful lens. Do not spoil it with a UV filter. Most filters sold are just glass pieces that do more harm than good to the photos.", "2. Try to put the cam on Manual focus. Half click as you focus till you get the beep. It takes time to learn but this will give you sensational pics and also will save the battery and the lens. Remember lens can get damaged if it is in AF and you try to focus manually.", "3. Never change the lens in a dusty place. Invisible dust can enter the cam and can cause blurring in picture.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  What makes this camera great is the price point at which it is being offered at. Considering a beginner gets to start with two kit lenses, this is a good first SLR camera. And both kit lenses are pretty capable, given that they were released only a few years ago, and are IS lenses. I think if 50mm f/1.8 prime lens is added to the collection, this camera can be a powerful machine at very competitive price.", "Night time shooting was pretty great, and IS lenses did show up their magic when shooting in low light. Especially notable is the quality of image for 55-250 zoom lens at telephoto end because of IS capability of the lens.", "Scene Intelligent Auto gives great results, if you are not in a mood to do all the manual settings.", "Pros:", "Price of the package", "Two IS kit lenses, covering from 18mm to 250mm", "Easily accessible buttons and intuitive camera menu navigation", "Various exposure control options like sports, night portrait, creative auto etc.", "Cons:", "In view of price of the package, nothing significant to mention. Would have preferred auto sensor cleaning feature, which is not there. Also, spot metering is absent, which might frustrate photographers who are looking to photograph birds etc. from a distance. Partial metering is to be used in place of spot metering, and this is less accurate.", "**Notes after four months of camera usage:", "1. Would recommend anybody using DPP for the first time to go through the 19 videos that are there on YouTube as 'Canon Digital Photo Professional Tutorial'. They are immensely useful.", "2. Continuous shooting - was able to get 88 JPEGs (fine, large) in 29 seconds approximately, before the camera paused for a very short breath. This was using a 16GB SDHC UHS-I Class 10 memory card. Also it was able to clock 6 RAW in approx. 3 seconds. As these results are not from standard lab conditions, and depend on various factors, other users may get different results.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  ", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Canon EOS 1200D 18MP Digital SLR Camera (Black) with 18-55mm and 55-250mm IS II Lens,8GB card and Carry Bag"]},
{"rating": [], "price": [" 32,790.00", " 32,790.00", " 36,995.00", " 32,790.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I was basically waiting for the D3300 for its newer sensor and Image processor, but once it was released, I realised that the D5200 was the same price as the D3300 after a heavy discount.", "Overall, at this price this is one of the best cameras available.", "1. Great image quality", "2. Low noise at high ISOs. I generally don't see any noise till ISO 3200, but even at ISO 6400, noise is minimum and can generally be removed using DXO 9", "3. Continuous shooting is nice. I can shoot indefinitely at around 2-3fps (RAW) using a Sandisk 90Mbps card", "4. Battery life is good. I can easily get by with one full day even with a Dawmtech GPS module attached. However, for people who want to get a second battery, I suggest them to get the EN-EL14A instead, as it provides more shots per charge", "5. In Camera HDR is more of a gimmick. It doesn't account for movement between shots and the resulting Dynamic Range isn't quite high. Better to manually bracket shots at -2,0,+2 and use a software like Photomatix for HDR.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  ", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  I upgraded my Nikon D80 to D5200.  I am impressed with its performance due 39 x 9 focusing points which gives sharp clear photographs. But this has no built in motor  inside for stability, and limited DX VR lens availability in market.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  The Camera is excellent . I've tried Indoor Shoots & few outdoors as well . I breifly used a Nikon D40 & Canon 600D . This one outshines them both. I am sure the generational updates have helped. Focus is crisp .", "The Kit lens is crap(what do you expect) but manageable for initial use.", "Accessories: The quality of the Neck strap is way poor. And the free Bag is probably the worst one I have come accross . Even if it was sold on the street for Rs100/- nobody will buy this . Its way-way poor than the ones Canon gives away with their cameras .", "Seller was good: Bought it from JJ mehta. Invoice was intact. The product has Nikon India Import address and is covered by Indian warranty for 2 years. I checked the seller before delivery and they promptly confirmed that .", "Overall it was a good experience. Will recommend for sure.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  i am more concerned about the warranty if i will buy any Nikon Camera from amazon.in", "As It was clearly mentioned in Nikon site (links are given below) that", "\"Please note that E-Commerce Websites are not our authorized partner/dealer........\"", "Will Amazon team or vendor put some light on the same. Early response is highly appreciated.", "Link 1: [...]", "Link 2: [...]\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  In the beginning I was a little skeptical about buying this gear. However, I gathered the courage to buy it as amazon offered the least price when compared with the other vendors and online platforms. I called up amazon to confirm the authenticity of the product. I was told that it was 100% genuine & that I could return it if I weren't satisfied. So, I purchased the camera to get bamboozled. I've been using the product from past one month and have been thoroughly enjoying it. This is my first DSLR and so far my journey in photography has been tremendous. The camera is just amazing for beginners. If you intend to buy a DSLR, I suggest you buy this without thinking too much because this is not gonna let you down. The 24.1 Mpa resolution will blow you away. Fastest shutter speed of 1/4000 of a sec is sufficient enough to capture a racing car if you know the nity-gritty of the techniques. In a nutshell, the product's worth giving a shot.", "Needless to say, amazon's service was quite reliable and efficient. I got the DSLR in just 2 days which was quite astonishing given the fact that the source from which it was dispatched was very far from my city.", "DO NOT THINK TWICE.. JUST GO FOR IT.. IT WILL NOT LET YOU DOWN FOR SURE...\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Nikon D5200 24.1MP Digital SLR Camera (Black) with AF-S 18-55 mm VR Kit Lens, Memory Card, Camera Bag"]},
{"rating": [], "price": [], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  seriously?", "official price is 53500 and you just increased to 58000 !", "you think people are that jobless that they will not notice it and will buy it?\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  This is plain cheating. . Rs.5000 for delivery charges? ?\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Official price is 53500 and this is bull s*** 62000(approx).\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Cheating how to overprice 5000K\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  ", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  An upgrade worth it.", "Satisfied\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  It couldn't be better\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  excellent product\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Apple iPhone 6 (Space Gray, 16GB)"]},
{"rating": [], "price": [" 24,859.00", " 29,990.00", " 29,999.00", " 24,868.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Hi folks! I have migrated to Nexus 5 from Galaxy Note (N7000) which was getting slower by the day. Before I made the purchase, I went to many electronic stores and tried out Samsung S5, Note 3 and Sony Z1 for hours. Sadly, I didn't find Nexus 5 on display anywhere, forcing me to rely on the reviews and feedback available on the Net. From what I read everywhere, I felt compelled to go for Nexus 5 and this is all I have to say:", "•It is sleek, lightweight and beautiful;", "•It is blazing fast;", "•It is as good as Samsung S5 /Note 3, if not better for 60% of the cost and it is definitely better than Sony Z1;", "•It being an official Google device, it will get priority updates for the next 18 months.", "•It has NO bloat-ware like Samsung etc. Google Now works like a charm.", "Cons? You don't get to insert a memory card or change the battery. Suits me fine: I don't believe in cramming in every known bit on earth in my phone's memory —I've hardly ever exceeded 8 GB till now. As for the battery, I am changing my phone every two years anyway. Camera? Go get a DSLR if you are serious about photography.", "So go ahead, pull a Nexus 5 off the shelf right away. You won't get a better phone today!\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  WORST packaging I have ever seen. Gabbar deals sent the 28000 Rs phone like a pack of socks. The package was not properly sealed. It was soaking wet due to rains. No shock protection, in fact no protection at all. Just a crappy soaking cardboard box. I can share the pics of the received package. Thankfully the phone was not damaged.. Or maybe it wasn't looking damaged. Very disappointed with the packaging. But very satisfied with the phone.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Almost one year and it is still a beast! I did not buy this phone on Amazon but bought it directly from Google in November last year (while I was in US). Since the phone has been with me for about an year now, I am tempted to write about how wonderful this phone is.", "Display and body:", "The display has been stunning and it remains so. I am not using any screen guard or a case for last several months and there is not even a single scratch on the screen. I am not over protecting, so I can vouch for the screen quality. The back of the phone does have some signs of wear but that is bound to happen to a white phone with no case. Still, it doesn't look like it's been used for an year. My Samsungs got really ugly within 3-4 months only.", "Performance:", "I have used Samsung Galaxy Note 1, Note 2 and HTC One and other than HTC, all Samsungs would got slow over time. I have had to reset the phones every few months to recover some of the performance back. With Nexus 5, it has been performing exceedingly well and I haven't reset it yet. The Snapdragon 800 processor is still one of best out there. I did have to reboot the phone a couple of times when the phone kind of hung, but that looked more like a third party app issue.", "Battery:", "This is the weakest point of the phone but is still good for a day of heavy usage. After 1 year of heavy use, I have noticed marginal decrease in the battery capacity, about 10% I would say. With a moderate usage, the phone can last of 1 and a half day easily, which is what most smartphones would last anyway. Since I always have access to some sort of charging facility, the battery has never been an issue for me, but could be for others.", "People of already said a lot of this phone, so I won't add any further. All I would say is that if you really want to spend less than 25k on a smartphone, then don't even look at any of the Micromax/Karbonn/Lenovo etc, just go for it. You would love it for sure.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Simply Awsm Googely.", "Those who are looking for android and your budget is up to 25000-26000 then go for it.", "It is worth of money.may be more than it.", "I've been using it since 1 month and experiencing much much better performance than htc,samsung&xperia.", "Wow factor", "Camera: Excellent with camera sphere feature.9/10", "Speed : Rocking like my vaio laptop. 10/10", "Display & touch : 9/10", "Music quality is good enough with headphone:8/10", "Battery:1 day without surfing too much,i said too much.9/10", "Missing-factor", "Sound quality without headphone is not amplified as it is having only one speaker One is for only microphone", "Network problem with bsnl sim.", "Overall it is very best phone among its other competitors like htc desire 816,samsung note3 neo,xperia z,and other china brands..\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Great phone!!!. I got it in 27k, really worth in this price. It's very light, very handy from usability perspective. Processing speed is very good..doesn't get hang at all. Only two issues I have noticed - the 1st one is that the battery gets discharged bit too quickly if you use it very much like watching videos, playing games etc. And the other one is it gets bit heated up but again this is only when you use it very extensively like playing high quality games etc. But as per my daily outside usability perspective, I am not finding myself in problem because of these two issues because I normally don't like to play much of games or video when I am outside and so I am easily getting around 24hrs of battery backup which is not bad at all and its not getting much heated up also.", "So, overall it's really nice to have this phone.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Google Nexus 5 D821 (16GB, Black)"]},
{"rating": [], "price": [" 42,999.00", " 46,975.00", " 48,750.00", " 40,099.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Best phone in market!!", "Bought it from Amazon, delivery was lil disappointing but at the end i got my phone before the time they committed. Just one little concern, when i searched warranty details through my IMEI number, it says my warranty is till 2nd Sep 2015 however i received my phone today i.e. 10th October. I guess i have to approach customer service in Amazon for this issue.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  ", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Best phone in the market, Its design, music quality, highest resolution screen, camera, 64 bit architecture, finger print sensor are just remarkable. Its lightweight and easy to use, It never hang. Using this phone, truly understand that Apple does not compromise with quality. People who complain about battery, turn off unnecessary location services of apps you don't use, Battery will last much longer. Android users just dying to prove them, but just because both reach to same destination one can't have comparison between Jaguar and Maruti suzuki. If you don’t have an iPhone, well, you don’t have an iPhone. Thanks Amazon.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Its really worth of money, in the end it's apple and the name is enough to describe everything.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  ", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  I Have bought iPhone 5S from \"Amazon.in\" and believe me delivery was also as per expected time-frame. Only first 2 days it was not updated but once it moved, it came very fast.Packing of the product was also good and it was per Amazon standard.", "Coming to the Product: I got this phone at the unbelievable low price, thanks to Amazon Diwali Dhamaka. Product is very much original, which you can reconfirm once you will put your IMEI no which says its not registered number and then you can registered yourself online. It shows Apple manufacturing warranty for 12months once you registered online. There is no problem in servicing also as Apple provides you warranty services for this phone (It is only some misconception around the people that it is not Apple Warranty if you purchase Online).. Trust me it is working very f9 as i am using it for last 3 weeks.. Battery is good and it is the Best phone at the price which i bought it..!!! Special thanks to Amazon for providing such a fantastic service..\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Apple iPhone 5s (Gold, 16GB)"]},
{"rating": [], "price": [" 8,059.00", " 8,158.00", " 8,699.00", " 7,999.00"], "comments": ["\n    ", "\n", "\n              \n\n\n\n\n\n\n", "\n\n", "\n\n            ", " \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Really a worthless phone..", "apart from the camera which is good..there is no single feature that could be appreciated.", "you cannoy use any google app from the device...there is nothing in the nokia android store..u cannot connect the device through the pc suit..neither is any option to change the bluetooth folder.", "I can say I just wasted my money on this...", "There are far more better options out there.", "Don't get fooled please.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Not upto the standards which Nokia is known for. I ordered this phone from Amazon. Delivery was not very prompt. It took almost 3-4 days though the phone was delivered from a location in Bangalore itself. I ignored the delayed delivery as I was looking forward to a Nokia experience. Till date I have been using Nokia phones only. My previous phone was a Nokia Lumia.", "I have been using the phone for the past 2 days. I have been facing a lot of issues.", "a. Phone hangs. I would have rebooted the phone at least 8-10 times in the last 2 days.", "b. Response from the touch screen is really really not up to the mark. Sometimes I have to tap 5 - 6 times for one function.", "c. There seems to be a problem in the audio hardware part of the phone. I called my family on a landline, I was able to hear them but they were not able to hear my voice. This happened 4 - 5 times today. After sometime every thing became normal when I called again and we were able to talk.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Nokia xl phone is a very bad phone. Because  it does not  support Whatsapp. Many other applications are also not supported. The battery life is also not good. By the way the screen size is good and you can enjoy movies and videos. But in my opinion it is not worth buying the phone.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n\n", "\n  Good phone. All the deatures work quite well except the music. The music in headphones is too low to hear. Otherwise I liked the phone a lot\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Mobile is best in class.", "You cannot switch to only 3g mode only auto mode will work.", "Battery Life is good than other android.", "One more thing if you like games please don't buy this phone only few games are supported.", "One more thing you have seen a video call option in samsung galaxy phones with front camera by which you can do video call directly to your friends  ::::but in Nokia XL no direct video call feature is available", "And sound is more than best in class but when you connect earphone in 3.5 mm Jack some video formats(mp4,3gp etc) sounds very low such like volume 1 of other phones =full volumeof XL only with earphone and mp3 will be medium in volume when connected to earphone", " And except these things everything is better than other Android in this price range", "To know more email me rishabhmani97@rediffmail.com\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Phone I got is ok but double tap to unlock not working I checked the settings performance is not good game stucks sound very low there is 3d sound setting and one more thing but useless download manager worst cant see resume there is an email software where u can add multiple account and they have given outlook waste of memory cleanup utility how it works dont know why it stops only one or two apps memory utilization always around 4000mb or above for more info use it at your own investment", "no datacable at all charging issue is there battery meter don't works fine\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Good in terms of hardware. Lovely !!!", "And I am not concerned about software as I can replace with any other OS.", "Didn't face any problem yet in terms of hardware.", "yup its heavy. But good build quality. Picture Quality good for both cams.", "Headset is of average only.", "No data cable. 2000 mah battery from nokia...!!! Good.", "Current OS is good for home usage. But not says its the ultimate. In OS android or IOS u can prefer.\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n", "\n  Nokia xl is the best budget phone with features such as a front camera & Rear camera and some inbuilt apps such as here maps ,zombies vs plants & many more apps it has a very big 5\" screen but somethings are there that we Shouldn't buy this mobile because it doesn't have playstore & the ram is very less you would use some third party app stores like yandex ,aptoide ,1mobile store & many more apps from my opinion its a good buy...\n", "\n\n\n\n\n\n\n\n\n\n\n\n\n", "\n", "\n\n\n\n", "\n\n\n\n\n\n\n\n\n\n\n", "\n        \n\n\n\n\n", "\n  ", " \n  \n\n\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n\n\n\n\n\n\n\n\n\n\n\n", " \n\n      "], "title": ["Nokia XL (Black, Dual SIM)"]}]